keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCif_reg.h
/**
 * \file IfxCif_reg.h
 * \brief
 * \copyright Copyright (c) 2012 Infineon Technologies AG. All rights reserved.
 *
 *
 * $Revision: 1586 $
 * $Date: 2013-09-03 14:43:49 +0200 (Di, 03 Sep 2013) $
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Cif_Cfg Cif address
 * \ingroup IfxLld_Cif
 * 
 * \defgroup IfxLld_Cif_Cfg_BaseAddress Base address
 * \ingroup IfxLld_Cif_Cfg
 * 
 * \defgroup IfxLld_Cif_Cfg_Cif 2-CIF
 * \ingroup IfxLld_Cif_Cfg
 * 
 */
#ifndef IFXCIF_REG_H
#define IFXCIF_REG_H
/******************************************************************************/
#include "IfxCif_regdef.h"
/******************************************************************************/
/** \addtogroup IfxLld_Cif_Cfg_BaseAddress
 * \{  */

/** \\brief  CIF object */
#define MODULE_CIF /*lint --e(923)*/ ((*(Ifx_CIF*)0xF90E1F00u))
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Cif_Cfg_Cif
 * \{  */

/** \\brief  C, Access Enable Register 0 */
#define CIF_BBB_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_CIF_BBB_ACCEN0*)0xF90E1F0Cu)

/** Alias (User Manual Name) for CIF_BBB_ACCEN0.
* To use register names with standard convension, please use CIF_BBB_ACCEN0.
*/
#define	CIFBBB_ACCEN0	(CIF_BBB_ACCEN0)

/** \\brief  10, Access Enable Register 1 */
#define CIF_BBB_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_CIF_BBB_ACCEN1*)0xF90E1F10u)

/** Alias (User Manual Name) for CIF_BBB_ACCEN1.
* To use register names with standard convension, please use CIF_BBB_ACCEN1.
*/
#define	CIFBBB_ACCEN1	(CIF_BBB_ACCEN1)

/** \\brief  0, Clock Control Register */
#define CIF_BBB_CLC /*lint --e(923)*/ (*(volatile Ifx_CIF_BBB_CLC*)0xF90E1F00u)

/** Alias (User Manual Name) for CIF_BBB_CLC.
* To use register names with standard convension, please use CIF_BBB_CLC.
*/
#define	CIFBBB_CLC	(CIF_BBB_CLC)

/** \\brief  8, General Purpose Control Register */
#define CIF_BBB_GPCTL /*lint --e(923)*/ (*(volatile Ifx_CIF_BBB_GPCTL*)0xF90E1F08u)

/** Alias (User Manual Name) for CIF_BBB_GPCTL.
* To use register names with standard convension, please use CIF_BBB_GPCTL.
*/
#define	CIFBBB_GPCTL	(CIF_BBB_GPCTL)

/** \\brief  14, Kernel Reset Register 0 */
#define CIF_BBB_KRST0 /*lint --e(923)*/ (*(volatile Ifx_CIF_BBB_KRST0*)0xF90E1F14u)

/** Alias (User Manual Name) for CIF_BBB_KRST0.
* To use register names with standard convension, please use CIF_BBB_KRST0.
*/
#define	CIFBBB_KRST0	(CIF_BBB_KRST0)

/** \\brief  18, Kernel Reset Register 1 */
#define CIF_BBB_KRST1 /*lint --e(923)*/ (*(volatile Ifx_CIF_BBB_KRST1*)0xF90E1F18u)

/** Alias (User Manual Name) for CIF_BBB_KRST1.
* To use register names with standard convension, please use CIF_BBB_KRST1.
*/
#define	CIFBBB_KRST1	(CIF_BBB_KRST1)

/** \\brief  1C, Kernel Reset Status Clear Register */
#define CIF_BBB_KRSTCLR /*lint --e(923)*/ (*(volatile Ifx_CIF_BBB_KRSTCLR*)0xF90E1F1Cu)

/** Alias (User Manual Name) for CIF_BBB_KRSTCLR.
* To use register names with standard convension, please use CIF_BBB_KRSTCLR.
*/
#define	CIFBBB_KRSTCLR	(CIF_BBB_KRSTCLR)

/** \\brief  4, Module Identification Register */
#define CIF_BBB_MODID /*lint --e(923)*/ (*(volatile Ifx_CIF_BBB_MODID*)0xF90E1F04u)

/** Alias (User Manual Name) for CIF_BBB_MODID.
* To use register names with standard convension, please use CIF_BBB_MODID.
*/
#define	CIFBBB_MODID	(CIF_BBB_MODID)

/** \\brief  100, Clock Control Register */
#define CIF_CCL /*lint --e(923)*/ (*(volatile Ifx_CIF_CCL*)0xF90E2000u)

/** \\brief  2800, Debug Path Control Register */
#define CIF_DP_CTRL /*lint --e(923)*/ (*(volatile Ifx_CIF_DP_CTRL*)0xF90E4700u)

/** Alias (User Manual Name) for CIF_DP_CTRL.
* To use register names with standard convension, please use CIF_DP_CTRL.
*/
#define	CIFDP_CTRL	(CIF_DP_CTRL)

/** \\brief  2808, Debug Path Frame/Line Counter Status Register */
#define CIF_DP_FLC_STAT /*lint --e(923)*/ (*(volatile Ifx_CIF_DP_FLC_STAT*)0xF90E4708u)

/** Alias (User Manual Name) for CIF_DP_FLC_STAT.
* To use register names with standard convension, please use CIF_DP_FLC_STAT.
*/
#define	CIFDP_FLC_STAT	(CIF_DP_FLC_STAT)

/** \\brief  2804, Debug Path Predivider Control Register */
#define CIF_DP_PDIV_CTRL /*lint --e(923)*/ (*(volatile Ifx_CIF_DP_PDIV_CTRL*)0xF90E4704u)

/** Alias (User Manual Name) for CIF_DP_PDIV_CTRL.
* To use register names with standard convension, please use CIF_DP_PDIV_CTRL.
*/
#define	CIFDP_PDIV_CTRL	(CIF_DP_PDIV_CTRL)

/** \\brief  280C, Debug Path Predivider Counter Status Register */
#define CIF_DP_PDIV_STAT /*lint --e(923)*/ (*(volatile Ifx_CIF_DP_PDIV_STAT*)0xF90E470Cu)

/** Alias (User Manual Name) for CIF_DP_PDIV_STAT.
* To use register names with standard convension, please use CIF_DP_PDIV_STAT.
*/
#define	CIFDP_PDIV_STAT	(CIF_DP_PDIV_STAT)

/** \\brief  2810, Debug Path Timestamp Counter Status Register */
#define CIF_DP_TSC_STAT /*lint --e(923)*/ (*(volatile Ifx_CIF_DP_TSC_STAT*)0xF90E4710u)

/** Alias (User Manual Name) for CIF_DP_TSC_STAT.
* To use register names with standard convension, please use CIF_DP_TSC_STAT.
*/
#define	CIFDP_TSC_STAT	(CIF_DP_TSC_STAT)

/** \\brief  2814, Debug Path User Defined Symbol Register \note Array index
 * shifted by 1. Example: defined register UDS_1S[0]/UDS_1S0 corresponds to user
 * manual UDS_1S1, ... */
#define CIF_DP_UDS_1S0 /*lint --e(923)*/ (*(volatile Ifx_CIF_DP_UDS*)0xF90E4714u)

/** Alias (User Manual Name) for CIF_DP_UDS_1S0.
* To use register names with standard convension, please use CIF_DP_UDS_1S0.
*/
#define	CIFDP_UDS_1	(CIF_DP_UDS_1S0)

/** \\brief  2818, Debug Path User Defined Symbol Register \note Array index
 * shifted by 1. Example: defined register UDS_1S[0]/UDS_1S0 corresponds to user
 * manual UDS_1S1, ... */
#define CIF_DP_UDS_1S1 /*lint --e(923)*/ (*(volatile Ifx_CIF_DP_UDS*)0xF90E4718u)

/** Alias (User Manual Name) for CIF_DP_UDS_1S1.
* To use register names with standard convension, please use CIF_DP_UDS_1S1.
*/
#define	CIFDP_UDS_2	(CIF_DP_UDS_1S1)

/** \\brief  281C, Debug Path User Defined Symbol Register \note Array index
 * shifted by 1. Example: defined register UDS_1S[0]/UDS_1S0 corresponds to user
 * manual UDS_1S1, ... */
#define CIF_DP_UDS_1S2 /*lint --e(923)*/ (*(volatile Ifx_CIF_DP_UDS*)0xF90E471Cu)

