keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCif_reg.h
/** Alias (User Manual Name) for CIF_DP_UDS_1S2.
* To use register names with standard convension, please use CIF_DP_UDS_1S2.
*/
#define	CIFDP_UDS_3	(CIF_DP_UDS_1S2)

/** \\brief  2820, Debug Path User Defined Symbol Register \note Array index
 * shifted by 1. Example: defined register UDS_1S[0]/UDS_1S0 corresponds to user
 * manual UDS_1S1, ... */
#define CIF_DP_UDS_1S3 /*lint --e(923)*/ (*(volatile Ifx_CIF_DP_UDS*)0xF90E4720u)

/** Alias (User Manual Name) for CIF_DP_UDS_1S3.
* To use register names with standard convension, please use CIF_DP_UDS_1S3.
*/
#define	CIFDP_UDS_4	(CIF_DP_UDS_1S3)

/** \\brief  2824, Debug Path User Defined Symbol Register \note Array index
 * shifted by 1. Example: defined register UDS_1S[0]/UDS_1S0 corresponds to user
 * manual UDS_1S1, ... */
#define CIF_DP_UDS_1S4 /*lint --e(923)*/ (*(volatile Ifx_CIF_DP_UDS*)0xF90E4724u)

/** Alias (User Manual Name) for CIF_DP_UDS_1S4.
* To use register names with standard convension, please use CIF_DP_UDS_1S4.
*/
#define	CIFDP_UDS_5	(CIF_DP_UDS_1S4)

/** \\brief  2828, Debug Path User Defined Symbol Register \note Array index
 * shifted by 1. Example: defined register UDS_1S[0]/UDS_1S0 corresponds to user
 * manual UDS_1S1, ... */
#define CIF_DP_UDS_1S5 /*lint --e(923)*/ (*(volatile Ifx_CIF_DP_UDS*)0xF90E4728u)

/** Alias (User Manual Name) for CIF_DP_UDS_1S5.
* To use register names with standard convension, please use CIF_DP_UDS_1S5.
*/
#define	CIFDP_UDS_6	(CIF_DP_UDS_1S5)

/** \\brief  282C, Debug Path User Defined Symbol Register \note Array index
 * shifted by 1. Example: defined register UDS_1S[0]/UDS_1S0 corresponds to user
 * manual UDS_1S1, ... */
#define CIF_DP_UDS_1S6 /*lint --e(923)*/ (*(volatile Ifx_CIF_DP_UDS*)0xF90E472Cu)

/** Alias (User Manual Name) for CIF_DP_UDS_1S6.
* To use register names with standard convension, please use CIF_DP_UDS_1S6.
*/
#define	CIFDP_UDS_7	(CIF_DP_UDS_1S6)

/** \\brief  2830, Debug Path User Defined Symbol Register \note Array index
 * shifted by 1. Example: defined register UDS_1S[0]/UDS_1S0 corresponds to user
 * manual UDS_1S1, ... */
#define CIF_DP_UDS_1S7 /*lint --e(923)*/ (*(volatile Ifx_CIF_DP_UDS*)0xF90E4730u)

/** Alias (User Manual Name) for CIF_DP_UDS_1S7.
* To use register names with standard convension, please use CIF_DP_UDS_1S7.
*/
#define	CIFDP_UDS_8	(CIF_DP_UDS_1S7)

/** \\brief  118, CIF Data Path Control Register */
#define CIF_DPCL /*lint --e(923)*/ (*(volatile Ifx_CIF_DPCL*)0xF90E2018u)

/** \\brief  2A00, Extra Path Image Cropping Control Register */
#define CIF_EP_IC_1S0_CTRL /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_CTRL*)0xF90E4900u)

/** Alias (User Manual Name) for CIF_EP_IC_1S0_CTRL.
* To use register names with standard convension, please use CIF_EP_IC_1S0_CTRL.
*/
#define	CIFEP_1_IC_CTRL	(CIF_EP_IC_1S0_CTRL)

/** \\brief  2A20, Extra Path Image Cropping Camera Displacement Register */
#define CIF_EP_IC_1S0_DISPLACE /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_DISPLACE*)0xF90E4920u)

/** Alias (User Manual Name) for CIF_EP_IC_1S0_DISPLACE.
* To use register names with standard convension, please use CIF_EP_IC_1S0_DISPLACE.
*/
#define	CIFEP_1_IC_DISPLACE	(CIF_EP_IC_1S0_DISPLACE)

/** \\brief  2A08, Extra Path Image Cropping Horizontal Offset of Output Window
 * Register */
#define CIF_EP_IC_1S0_H_OFFS /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_H_OFFS*)0xF90E4908u)

/** Alias (User Manual Name) for CIF_EP_IC_1S0_H_OFFS.
* To use register names with standard convension, please use CIF_EP_IC_1S0_H_OFFS.
*/
#define	CIFEP_1_IC_H_OFFS	(CIF_EP_IC_1S0_H_OFFS)

/** \\brief  2A24, Extra Path Image Current Horizontal Offset Of Output Window
 * Shadow Register */
#define CIF_EP_IC_1S0_H_OFFS_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_H_OFFS_SHD*)0xF90E4924u)

/** Alias (User Manual Name) for CIF_EP_IC_1S0_H_OFFS_SHD.
* To use register names with standard convension, please use CIF_EP_IC_1S0_H_OFFS_SHD.
*/
#define	CIFEP_1_IC_H_OFFS_SHD	(CIF_EP_IC_1S0_H_OFFS_SHD)

/** \\brief  2A10, Extra Path Image Cropping Output Horizontal Picture Size
 * Register */
#define CIF_EP_IC_1S0_H_SIZE /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_H_SIZE*)0xF90E4910u)

/** Alias (User Manual Name) for CIF_EP_IC_1S0_H_SIZE.
* To use register names with standard convension, please use CIF_EP_IC_1S0_H_SIZE.
*/
#define	CIFEP_1_IC_H_SIZE	(CIF_EP_IC_1S0_H_SIZE)

/** \\brief  2A2C, Extra Path Image Current Output Horizontal Picture Size
 * Shadow Register */
#define CIF_EP_IC_1S0_H_SIZE_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_H_SIZE_SHD*)0xF90E492Cu)

/** Alias (User Manual Name) for CIF_EP_IC_1S0_H_SIZE_SHD.
* To use register names with standard convension, please use CIF_EP_IC_1S0_H_SIZE_SHD.
*/
#define	CIFEP_1_IC_H_SIZE_SHD	(CIF_EP_IC_1S0_H_SIZE_SHD)

/** \\brief  2A18, Extra Path Image Cropping Maximum Horizontal Displacement
 * Register */
#define CIF_EP_IC_1S0_MAX_DX /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_MAX_DX*)0xF90E4918u)

/** Alias (User Manual Name) for CIF_EP_IC_1S0_MAX_DX.
* To use register names with standard convension, please use CIF_EP_IC_1S0_MAX_DX.
*/
#define	CIFEP_1_IC_MAX_DX	(CIF_EP_IC_1S0_MAX_DX)

/** \\brief  2A1C, Extra Path Image Cropping Maximum Vertical Displacement
 * Register */
#define CIF_EP_IC_1S0_MAX_DY /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_MAX_DY*)0xF90E491Cu)

/** Alias (User Manual Name) for CIF_EP_IC_1S0_MAX_DY.
* To use register names with standard convension, please use CIF_EP_IC_1S0_MAX_DY.
*/
#define	CIFEP_1_IC_MAX_DY	(CIF_EP_IC_1S0_MAX_DY)

/** \\brief  2A04, Extra Path Image Cropping Recenter Register */
#define CIF_EP_IC_1S0_RECENTER /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_RECENTER*)0xF90E4904u)

/** Alias (User Manual Name) for CIF_EP_IC_1S0_RECENTER.
* To use register names with standard convension, please use CIF_EP_IC_1S0_RECENTER.
*/
#define	CIFEP_1_IC_RECENTER	(CIF_EP_IC_1S0_RECENTER)

/** \\brief  2A0C, Extra Path Image Cropping Vertical Offset Of Output Window
 * Register */
#define CIF_EP_IC_1S0_V_OFFS /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_V_OFFS*)0xF90E490Cu)

/** Alias (User Manual Name) for CIF_EP_IC_1S0_V_OFFS.
* To use register names with standard convension, please use CIF_EP_IC_1S0_V_OFFS.
*/
#define	CIFEP_1_IC_V_OFFS	(CIF_EP_IC_1S0_V_OFFS)

/** \\brief  2A28, Extra Path Image Current Vertical Offset Of Output Window
 * Shadow Register */
#define CIF_EP_IC_1S0_V_OFFS_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_V_OFFS_SHD*)0xF90E4928u)

