keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCif_reg.h
/** \\brief  2C00, Extra Path Image Cropping Control Register */
#define CIF_EP_IC_1S2_CTRL /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_CTRL*)0xF90E4B00u)

/** Alias (User Manual Name) for CIF_EP_IC_1S2_CTRL.
* To use register names with standard convension, please use CIF_EP_IC_1S2_CTRL.
*/
#define	CIFEP_3_IC_CTRL	(CIF_EP_IC_1S2_CTRL)

/** \\brief  2C20, Extra Path Image Cropping Camera Displacement Register */
#define CIF_EP_IC_1S2_DISPLACE /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_DISPLACE*)0xF90E4B20u)

/** Alias (User Manual Name) for CIF_EP_IC_1S2_DISPLACE.
* To use register names with standard convension, please use CIF_EP_IC_1S2_DISPLACE.
*/
#define	CIFEP_3_IC_DISPLACE	(CIF_EP_IC_1S2_DISPLACE)

/** \\brief  2C08, Extra Path Image Cropping Horizontal Offset of Output Window
 * Register */
#define CIF_EP_IC_1S2_H_OFFS /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_H_OFFS*)0xF90E4B08u)

/** Alias (User Manual Name) for CIF_EP_IC_1S2_H_OFFS.
* To use register names with standard convension, please use CIF_EP_IC_1S2_H_OFFS.
*/
#define	CIFEP_3_IC_H_OFFS	(CIF_EP_IC_1S2_H_OFFS)

/** \\brief  2C24, Extra Path Image Current Horizontal Offset Of Output Window
 * Shadow Register */
#define CIF_EP_IC_1S2_H_OFFS_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_H_OFFS_SHD*)0xF90E4B24u)

/** Alias (User Manual Name) for CIF_EP_IC_1S2_H_OFFS_SHD.
* To use register names with standard convension, please use CIF_EP_IC_1S2_H_OFFS_SHD.
*/
#define	CIFEP_3_IC_H_OFFS_SHD	(CIF_EP_IC_1S2_H_OFFS_SHD)

/** \\brief  2C10, Extra Path Image Cropping Output Horizontal Picture Size
 * Register */
#define CIF_EP_IC_1S2_H_SIZE /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_H_SIZE*)0xF90E4B10u)

/** Alias (User Manual Name) for CIF_EP_IC_1S2_H_SIZE.
* To use register names with standard convension, please use CIF_EP_IC_1S2_H_SIZE.
*/
#define	CIFEP_3_IC_H_SIZE	(CIF_EP_IC_1S2_H_SIZE)

/** \\brief  2C2C, Extra Path Image Current Output Horizontal Picture Size
 * Shadow Register */
#define CIF_EP_IC_1S2_H_SIZE_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_H_SIZE_SHD*)0xF90E4B2Cu)

/** Alias (User Manual Name) for CIF_EP_IC_1S2_H_SIZE_SHD.
* To use register names with standard convension, please use CIF_EP_IC_1S2_H_SIZE_SHD.
*/
#define	CIFEP_3_IC_H_SIZE_SHD	(CIF_EP_IC_1S2_H_SIZE_SHD)

/** \\brief  2C18, Extra Path Image Cropping Maximum Horizontal Displacement
 * Register */
#define CIF_EP_IC_1S2_MAX_DX /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_MAX_DX*)0xF90E4B18u)

/** Alias (User Manual Name) for CIF_EP_IC_1S2_MAX_DX.
* To use register names with standard convension, please use CIF_EP_IC_1S2_MAX_DX.
*/
#define	CIFEP_3_IC_MAX_DX	(CIF_EP_IC_1S2_MAX_DX)

/** \\brief  2C1C, Extra Path Image Cropping Maximum Vertical Displacement
 * Register */
#define CIF_EP_IC_1S2_MAX_DY /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_MAX_DY*)0xF90E4B1Cu)

/** Alias (User Manual Name) for CIF_EP_IC_1S2_MAX_DY.
* To use register names with standard convension, please use CIF_EP_IC_1S2_MAX_DY.
*/
#define	CIFEP_3_IC_MAX_DY	(CIF_EP_IC_1S2_MAX_DY)

/** \\brief  2C04, Extra Path Image Cropping Recenter Register */
#define CIF_EP_IC_1S2_RECENTER /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_RECENTER*)0xF90E4B04u)

/** Alias (User Manual Name) for CIF_EP_IC_1S2_RECENTER.
* To use register names with standard convension, please use CIF_EP_IC_1S2_RECENTER.
*/
#define	CIFEP_3_IC_RECENTER	(CIF_EP_IC_1S2_RECENTER)

/** \\brief  2C0C, Extra Path Image Cropping Vertical Offset Of Output Window
 * Register */
#define CIF_EP_IC_1S2_V_OFFS /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_V_OFFS*)0xF90E4B0Cu)

/** Alias (User Manual Name) for CIF_EP_IC_1S2_V_OFFS.
* To use register names with standard convension, please use CIF_EP_IC_1S2_V_OFFS.
*/
#define	CIFEP_3_IC_V_OFFS	(CIF_EP_IC_1S2_V_OFFS)

/** \\brief  2C28, Extra Path Image Current Vertical Offset Of Output Window
 * Shadow Register */
#define CIF_EP_IC_1S2_V_OFFS_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_V_OFFS_SHD*)0xF90E4B28u)

/** Alias (User Manual Name) for CIF_EP_IC_1S2_V_OFFS_SHD.
* To use register names with standard convension, please use CIF_EP_IC_1S2_V_OFFS_SHD.
*/
#define	CIFEP_3_IC_V_OFFS_SHD	(CIF_EP_IC_1S2_V_OFFS_SHD)

/** \\brief  2C14, Extra Path Image Cropping Output Vertical Picture Size
 * Register */
#define CIF_EP_IC_1S2_V_SIZE /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_V_SIZE*)0xF90E4B14u)

/** Alias (User Manual Name) for CIF_EP_IC_1S2_V_SIZE.
* To use register names with standard convension, please use CIF_EP_IC_1S2_V_SIZE.
*/
#define	CIFEP_3_IC_V_SIZE	(CIF_EP_IC_1S2_V_SIZE)

/** \\brief  2C30, Extra Path Image Current Output Vertical Picture Size Shadow
 * Register */
#define CIF_EP_IC_1S2_V_SIZE_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_V_SIZE_SHD*)0xF90E4B30u)

/** Alias (User Manual Name) for CIF_EP_IC_1S2_V_SIZE_SHD.
* To use register names with standard convension, please use CIF_EP_IC_1S2_V_SIZE_SHD.
*/
#define	CIFEP_3_IC_V_SIZE_SHD	(CIF_EP_IC_1S2_V_SIZE_SHD)

/** \\brief  2D00, Extra Path Image Cropping Control Register */
#define CIF_EP_IC_1S3_CTRL /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_CTRL*)0xF90E4C00u)

/** Alias (User Manual Name) for CIF_EP_IC_1S3_CTRL.
* To use register names with standard convension, please use CIF_EP_IC_1S3_CTRL.
*/
#define	CIFEP_4_IC_CTRL	(CIF_EP_IC_1S3_CTRL)

/** \\brief  2D20, Extra Path Image Cropping Camera Displacement Register */
#define CIF_EP_IC_1S3_DISPLACE /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_DISPLACE*)0xF90E4C20u)

/** Alias (User Manual Name) for CIF_EP_IC_1S3_DISPLACE.
* To use register names with standard convension, please use CIF_EP_IC_1S3_DISPLACE.
*/
#define	CIFEP_4_IC_DISPLACE	(CIF_EP_IC_1S3_DISPLACE)

/** \\brief  2D08, Extra Path Image Cropping Horizontal Offset of Output Window
 * Register */
#define CIF_EP_IC_1S3_H_OFFS /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_H_OFFS*)0xF90E4C08u)

/** Alias (User Manual Name) for CIF_EP_IC_1S3_H_OFFS.
* To use register names with standard convension, please use CIF_EP_IC_1S3_H_OFFS.
*/
#define	CIFEP_4_IC_H_OFFS	(CIF_EP_IC_1S3_H_OFFS)

