keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCif_reg.h
/** \\brief  2D24, Extra Path Image Current Horizontal Offset Of Output Window
 * Shadow Register */
#define CIF_EP_IC_1S3_H_OFFS_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_H_OFFS_SHD*)0xF90E4C24u)

/** Alias (User Manual Name) for CIF_EP_IC_1S3_H_OFFS_SHD.
* To use register names with standard convension, please use CIF_EP_IC_1S3_H_OFFS_SHD.
*/
#define	CIFEP_4_IC_H_OFFS_SHD	(CIF_EP_IC_1S3_H_OFFS_SHD)

/** \\brief  2D10, Extra Path Image Cropping Output Horizontal Picture Size
 * Register */
#define CIF_EP_IC_1S3_H_SIZE /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_H_SIZE*)0xF90E4C10u)

/** Alias (User Manual Name) for CIF_EP_IC_1S3_H_SIZE.
* To use register names with standard convension, please use CIF_EP_IC_1S3_H_SIZE.
*/
#define	CIFEP_4_IC_H_SIZE	(CIF_EP_IC_1S3_H_SIZE)

/** \\brief  2D2C, Extra Path Image Current Output Horizontal Picture Size
 * Shadow Register */
#define CIF_EP_IC_1S3_H_SIZE_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_H_SIZE_SHD*)0xF90E4C2Cu)

/** Alias (User Manual Name) for CIF_EP_IC_1S3_H_SIZE_SHD.
* To use register names with standard convension, please use CIF_EP_IC_1S3_H_SIZE_SHD.
*/
#define	CIFEP_4_IC_H_SIZE_SHD	(CIF_EP_IC_1S3_H_SIZE_SHD)

/** \\brief  2D18, Extra Path Image Cropping Maximum Horizontal Displacement
 * Register */
#define CIF_EP_IC_1S3_MAX_DX /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_MAX_DX*)0xF90E4C18u)

/** Alias (User Manual Name) for CIF_EP_IC_1S3_MAX_DX.
* To use register names with standard convension, please use CIF_EP_IC_1S3_MAX_DX.
*/
#define	CIFEP_4_IC_MAX_DX	(CIF_EP_IC_1S3_MAX_DX)

/** \\brief  2D1C, Extra Path Image Cropping Maximum Vertical Displacement
 * Register */
#define CIF_EP_IC_1S3_MAX_DY /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_MAX_DY*)0xF90E4C1Cu)

/** Alias (User Manual Name) for CIF_EP_IC_1S3_MAX_DY.
* To use register names with standard convension, please use CIF_EP_IC_1S3_MAX_DY.
*/
#define	CIFEP_4_IC_MAX_DY	(CIF_EP_IC_1S3_MAX_DY)

/** \\brief  2D04, Extra Path Image Cropping Recenter Register */
#define CIF_EP_IC_1S3_RECENTER /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_RECENTER*)0xF90E4C04u)

/** Alias (User Manual Name) for CIF_EP_IC_1S3_RECENTER.
* To use register names with standard convension, please use CIF_EP_IC_1S3_RECENTER.
*/
#define	CIFEP_4_IC_RECENTER	(CIF_EP_IC_1S3_RECENTER)

/** \\brief  2D0C, Extra Path Image Cropping Vertical Offset Of Output Window
 * Register */
#define CIF_EP_IC_1S3_V_OFFS /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_V_OFFS*)0xF90E4C0Cu)

/** Alias (User Manual Name) for CIF_EP_IC_1S3_V_OFFS.
* To use register names with standard convension, please use CIF_EP_IC_1S3_V_OFFS.
*/
#define	CIFEP_4_IC_V_OFFS	(CIF_EP_IC_1S3_V_OFFS)

/** \\brief  2D28, Extra Path Image Current Vertical Offset Of Output Window
 * Shadow Register */
#define CIF_EP_IC_1S3_V_OFFS_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_V_OFFS_SHD*)0xF90E4C28u)

/** Alias (User Manual Name) for CIF_EP_IC_1S3_V_OFFS_SHD.
* To use register names with standard convension, please use CIF_EP_IC_1S3_V_OFFS_SHD.
*/
#define	CIFEP_4_IC_V_OFFS_SHD	(CIF_EP_IC_1S3_V_OFFS_SHD)

/** \\brief  2D14, Extra Path Image Cropping Output Vertical Picture Size
 * Register */
#define CIF_EP_IC_1S3_V_SIZE /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_V_SIZE*)0xF90E4C14u)

/** Alias (User Manual Name) for CIF_EP_IC_1S3_V_SIZE.
* To use register names with standard convension, please use CIF_EP_IC_1S3_V_SIZE.
*/
#define	CIFEP_4_IC_V_SIZE	(CIF_EP_IC_1S3_V_SIZE)

/** \\brief  2D30, Extra Path Image Current Output Vertical Picture Size Shadow
 * Register */
#define CIF_EP_IC_1S3_V_SIZE_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_V_SIZE_SHD*)0xF90E4C30u)

/** Alias (User Manual Name) for CIF_EP_IC_1S3_V_SIZE_SHD.
* To use register names with standard convension, please use CIF_EP_IC_1S3_V_SIZE_SHD.
*/
#define	CIFEP_4_IC_V_SIZE_SHD	(CIF_EP_IC_1S3_V_SIZE_SHD)

/** \\brief  2E00, Extra Path Image Cropping Control Register */
#define CIF_EP_IC_1S4_CTRL /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_CTRL*)0xF90E4D00u)

/** Alias (User Manual Name) for CIF_EP_IC_1S4_CTRL.
* To use register names with standard convension, please use CIF_EP_IC_1S4_CTRL.
*/
#define	CIFEP_5_IC_CTRL	(CIF_EP_IC_1S4_CTRL)

/** \\brief  2E20, Extra Path Image Cropping Camera Displacement Register */
#define CIF_EP_IC_1S4_DISPLACE /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_DISPLACE*)0xF90E4D20u)

/** Alias (User Manual Name) for CIF_EP_IC_1S4_DISPLACE.
* To use register names with standard convension, please use CIF_EP_IC_1S4_DISPLACE.
*/
#define	CIFEP_5_IC_DISPLACE	(CIF_EP_IC_1S4_DISPLACE)

/** \\brief  2E08, Extra Path Image Cropping Horizontal Offset of Output Window
 * Register */
#define CIF_EP_IC_1S4_H_OFFS /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_H_OFFS*)0xF90E4D08u)

/** Alias (User Manual Name) for CIF_EP_IC_1S4_H_OFFS.
* To use register names with standard convension, please use CIF_EP_IC_1S4_H_OFFS.
*/
#define	CIFEP_5_IC_H_OFFS	(CIF_EP_IC_1S4_H_OFFS)

/** \\brief  2E24, Extra Path Image Current Horizontal Offset Of Output Window
 * Shadow Register */
#define CIF_EP_IC_1S4_H_OFFS_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_H_OFFS_SHD*)0xF90E4D24u)

/** Alias (User Manual Name) for CIF_EP_IC_1S4_H_OFFS_SHD.
* To use register names with standard convension, please use CIF_EP_IC_1S4_H_OFFS_SHD.
*/
#define	CIFEP_5_IC_H_OFFS_SHD	(CIF_EP_IC_1S4_H_OFFS_SHD)

/** \\brief  2E10, Extra Path Image Cropping Output Horizontal Picture Size
 * Register */
#define CIF_EP_IC_1S4_H_SIZE /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_H_SIZE*)0xF90E4D10u)

/** Alias (User Manual Name) for CIF_EP_IC_1S4_H_SIZE.
* To use register names with standard convension, please use CIF_EP_IC_1S4_H_SIZE.
*/
#define	CIFEP_5_IC_H_SIZE	(CIF_EP_IC_1S4_H_SIZE)

/** \\brief  2E2C, Extra Path Image Current Output Horizontal Picture Size
 * Shadow Register */
#define CIF_EP_IC_1S4_H_SIZE_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_H_SIZE_SHD*)0xF90E4D2Cu)

/** Alias (User Manual Name) for CIF_EP_IC_1S4_H_SIZE_SHD.
* To use register names with standard convension, please use CIF_EP_IC_1S4_H_SIZE_SHD.
*/
#define	CIFEP_5_IC_H_SIZE_SHD	(CIF_EP_IC_1S4_H_SIZE_SHD)

/** \\brief  2E18, Extra Path Image Cropping Maximum Horizontal Displacement
 * Register */
#define CIF_EP_IC_1S4_MAX_DX /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_MAX_DX*)0xF90E4D18u)

/** Alias (User Manual Name) for CIF_EP_IC_1S4_MAX_DX.
* To use register names with standard convension, please use CIF_EP_IC_1S4_MAX_DX.
*/
#define	CIFEP_5_IC_MAX_DX	(CIF_EP_IC_1S4_MAX_DX)

