keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCif_reg.h
/** \\brief  2E1C, Extra Path Image Cropping Maximum Vertical Displacement
 * Register */
#define CIF_EP_IC_1S4_MAX_DY /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_MAX_DY*)0xF90E4D1Cu)

/** Alias (User Manual Name) for CIF_EP_IC_1S4_MAX_DY.
* To use register names with standard convension, please use CIF_EP_IC_1S4_MAX_DY.
*/
#define	CIFEP_5_IC_MAX_DY	(CIF_EP_IC_1S4_MAX_DY)

/** \\brief  2E04, Extra Path Image Cropping Recenter Register */
#define CIF_EP_IC_1S4_RECENTER /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_RECENTER*)0xF90E4D04u)

/** Alias (User Manual Name) for CIF_EP_IC_1S4_RECENTER.
* To use register names with standard convension, please use CIF_EP_IC_1S4_RECENTER.
*/
#define	CIFEP_5_IC_RECENTER	(CIF_EP_IC_1S4_RECENTER)

/** \\brief  2E0C, Extra Path Image Cropping Vertical Offset Of Output Window
 * Register */
#define CIF_EP_IC_1S4_V_OFFS /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_V_OFFS*)0xF90E4D0Cu)

/** Alias (User Manual Name) for CIF_EP_IC_1S4_V_OFFS.
* To use register names with standard convension, please use CIF_EP_IC_1S4_V_OFFS.
*/
#define	CIFEP_5_IC_V_OFFS	(CIF_EP_IC_1S4_V_OFFS)

/** \\brief  2E28, Extra Path Image Current Vertical Offset Of Output Window
 * Shadow Register */
#define CIF_EP_IC_1S4_V_OFFS_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_V_OFFS_SHD*)0xF90E4D28u)

/** Alias (User Manual Name) for CIF_EP_IC_1S4_V_OFFS_SHD.
* To use register names with standard convension, please use CIF_EP_IC_1S4_V_OFFS_SHD.
*/
#define	CIFEP_5_IC_V_OFFS_SHD	(CIF_EP_IC_1S4_V_OFFS_SHD)

/** \\brief  2E14, Extra Path Image Cropping Output Vertical Picture Size
 * Register */
#define CIF_EP_IC_1S4_V_SIZE /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_V_SIZE*)0xF90E4D14u)

/** Alias (User Manual Name) for CIF_EP_IC_1S4_V_SIZE.
* To use register names with standard convension, please use CIF_EP_IC_1S4_V_SIZE.
*/
#define	CIFEP_5_IC_V_SIZE	(CIF_EP_IC_1S4_V_SIZE)

/** \\brief  2E30, Extra Path Image Current Output Vertical Picture Size Shadow
 * Register */
#define CIF_EP_IC_1S4_V_SIZE_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_V_SIZE_SHD*)0xF90E4D30u)

/** Alias (User Manual Name) for CIF_EP_IC_1S4_V_SIZE_SHD.
* To use register names with standard convension, please use CIF_EP_IC_1S4_V_SIZE_SHD.
*/
#define	CIFEP_5_IC_V_SIZE_SHD	(CIF_EP_IC_1S4_V_SIZE_SHD)

/** \\brief  110, CIF Internal Clock Control Register */
#define CIF_ICCL /*lint --e(923)*/ (*(volatile Ifx_CIF_ICCL*)0xF90E2010u)

/** \\brief  108, CIF Revision Identification Register */
#define CIF_ID /*lint --e(923)*/ (*(volatile Ifx_CIF_ID*)0xF90E2008u)

/** \\brief  114, CIF Internal Reset Control Register */
#define CIF_IRCL /*lint --e(923)*/ (*(volatile Ifx_CIF_IRCL*)0xF90E2014u)

/** \\brief  508, ISP Acquisition Horizontal Offset Register */
#define CIF_ISP_ACQ_H_OFFS /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_ACQ_H_OFFS*)0xF90E2408u)

/** Alias (User Manual Name) for CIF_ISP_ACQ_H_OFFS.
* To use register names with standard convension, please use CIF_ISP_ACQ_H_OFFS.
*/
#define	CIFISP_ACQ_H_OFFS	(CIF_ISP_ACQ_H_OFFS)

/** \\brief  510, ISP Acquisition Horizontal Size Register */
#define CIF_ISP_ACQ_H_SIZE /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_ACQ_H_SIZE*)0xF90E2410u)

/** Alias (User Manual Name) for CIF_ISP_ACQ_H_SIZE.
* To use register names with standard convension, please use CIF_ISP_ACQ_H_SIZE.
*/
#define	CIFISP_ACQ_H_SIZE	(CIF_ISP_ACQ_H_SIZE)

/** \\brief  518, ISP Acquisition Number of Frames Register */
#define CIF_ISP_ACQ_NR_FRAMES /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_ACQ_NR_FRAMES*)0xF90E2418u)

/** Alias (User Manual Name) for CIF_ISP_ACQ_NR_FRAMES.
* To use register names with standard convension, please use CIF_ISP_ACQ_NR_FRAMES.
*/
#define	CIFISP_ACQ_NR_FRAMES	(CIF_ISP_ACQ_NR_FRAMES)

/** \\brief  504, ISP Acquisition Properties Register */
#define CIF_ISP_ACQ_PROP /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_ACQ_PROP*)0xF90E2404u)

/** Alias (User Manual Name) for CIF_ISP_ACQ_PROP.
* To use register names with standard convension, please use CIF_ISP_ACQ_PROP.
*/
#define	CIFISP_ACQ_PROP	(CIF_ISP_ACQ_PROP)

/** \\brief  50C, ISP Acquistion Vertical Offset Register */
#define CIF_ISP_ACQ_V_OFFS /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_ACQ_V_OFFS*)0xF90E240Cu)

/** Alias (User Manual Name) for CIF_ISP_ACQ_V_OFFS.
* To use register names with standard convension, please use CIF_ISP_ACQ_V_OFFS.
*/
#define	CIFISP_ACQ_V_OFFS	(CIF_ISP_ACQ_V_OFFS)

/** \\brief  514, ISP Acquisition Vertical Size Register */
#define CIF_ISP_ACQ_V_SIZE /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_ACQ_V_SIZE*)0xF90E2414u)

/** Alias (User Manual Name) for CIF_ISP_ACQ_V_SIZE.
* To use register names with standard convension, please use CIF_ISP_ACQ_V_SIZE.
*/
#define	CIFISP_ACQ_V_SIZE	(CIF_ISP_ACQ_V_SIZE)

/** \\brief  500, ISP Global Control Register */
#define CIF_ISP_CTRL /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_CTRL*)0xF90E2400u)

/** Alias (User Manual Name) for CIF_ISP_CTRL.
* To use register names with standard convension, please use CIF_ISP_CTRL.
*/
#define	CIFISP_CTRL	(CIF_ISP_CTRL)

/** \\brief  73C, ISP Error Register */
#define CIF_ISP_ERR /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_ERR*)0xF90E263Cu)

/** Alias (User Manual Name) for CIF_ISP_ERR.
* To use register names with standard convension, please use CIF_ISP_ERR.
*/
#define	CIFISP_ERR	(CIF_ISP_ERR)

/** \\brief  740, ISP Error Clear Register */
#define CIF_ISP_ERR_CLR /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_ERR_CLR*)0xF90E2640u)

/** Alias (User Manual Name) for CIF_ISP_ERR_CLR.
* To use register names with standard convension, please use CIF_ISP_ERR_CLR.
*/
#define	CIFISP_ERR_CLR	(CIF_ISP_ERR_CLR)

/** \\brief  6A8, ISP Shadow Flags Register */
#define CIF_ISP_FLAGS_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_FLAGS_SHD*)0xF90E25A8u)

/** Alias (User Manual Name) for CIF_ISP_FLAGS_SHD.
* To use register names with standard convension, please use CIF_ISP_FLAGS_SHD.
*/
#define	CIFISP_FLAGS_SHD	(CIF_ISP_FLAGS_SHD)

/** \\brief  744, ISP Frame Counter Register */
#define CIF_ISP_FRAME_COUNT /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_FRAME_COUNT*)0xF90E2644u)

