keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCif_reg.h
/** Alias (User Manual Name) for CIF_ISP_FRAME_COUNT.
* To use register names with standard convension, please use CIF_ISP_FRAME_COUNT.
*/
#define	CIFISP_FRAME_COUNT	(CIF_ISP_FRAME_COUNT)

/** \\brief  6C8, ISP Interrupt Clear Register */
#define CIF_ISP_ICR /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_ICR*)0xF90E25C8u)

/** Alias (User Manual Name) for CIF_ISP_ICR.
* To use register names with standard convension, please use CIF_ISP_ICR.
*/
#define	CIFISP_ICR	(CIF_ISP_ICR)

/** \\brief  6BC, ISP Interrupt Mask Register */
#define CIF_ISP_IMSC /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_IMSC*)0xF90E25BCu)

/** Alias (User Manual Name) for CIF_ISP_IMSC.
* To use register names with standard convension, please use CIF_ISP_IMSC.
*/
#define	CIFISP_IMSC	(CIF_ISP_IMSC)

/** \\brief  6CC, ISP Interrupt Set Register */
#define CIF_ISP_ISR /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_ISR*)0xF90E25CCu)

/** Alias (User Manual Name) for CIF_ISP_ISR.
* To use register names with standard convension, please use CIF_ISP_ISR.
*/
#define	CIFISP_ISR	(CIF_ISP_ISR)

/** \\brief  6C4, ISP Masked Interrupt Status Register */
#define CIF_ISP_MIS /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_MIS*)0xF90E25C4u)

/** Alias (User Manual Name) for CIF_ISP_MIS.
* To use register names with standard convension, please use CIF_ISP_MIS.
*/
#define	CIFISP_MIS	(CIF_ISP_MIS)

/** \\brief  694, ISP Output Window Horizontal Offset Register */
#define CIF_ISP_OUT_H_OFFS /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_OUT_H_OFFS*)0xF90E2594u)

/** Alias (User Manual Name) for CIF_ISP_OUT_H_OFFS.
* To use register names with standard convension, please use CIF_ISP_OUT_H_OFFS.
*/
#define	CIFISP_OUT_H_OFFS	(CIF_ISP_OUT_H_OFFS)

/** \\brief  6AC, ISP Output Window Horizontal Offset Shadow Register */
#define CIF_ISP_OUT_H_OFFS_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_OUT_H_OFFS_SHD*)0xF90E25ACu)

/** Alias (User Manual Name) for CIF_ISP_OUT_H_OFFS_SHD.
* To use register names with standard convension, please use CIF_ISP_OUT_H_OFFS_SHD.
*/
#define	CIFISP_OUT_H_OFFS_SHD	(CIF_ISP_OUT_H_OFFS_SHD)

/** \\brief  69C, ISP Output Horizontal Picture Size Register */
#define CIF_ISP_OUT_H_SIZE /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_OUT_H_SIZE*)0xF90E259Cu)

/** Alias (User Manual Name) for CIF_ISP_OUT_H_SIZE.
* To use register names with standard convension, please use CIF_ISP_OUT_H_SIZE.
*/
#define	CIFISP_OUT_H_SIZE	(CIF_ISP_OUT_H_SIZE)

/** \\brief  6B4, ISP Output Horizontal Picture Size Shadow Register */
#define CIF_ISP_OUT_H_SIZE_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_OUT_H_SIZE_SHD*)0xF90E25B4u)

/** Alias (User Manual Name) for CIF_ISP_OUT_H_SIZE_SHD.
* To use register names with standard convension, please use CIF_ISP_OUT_H_SIZE_SHD.
*/
#define	CIFISP_OUT_H_SIZE_SHD	(CIF_ISP_OUT_H_SIZE_SHD)

/** \\brief  698, ISP Output Window Vertical Offset Register */
#define CIF_ISP_OUT_V_OFFS /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_OUT_V_OFFS*)0xF90E2598u)

/** Alias (User Manual Name) for CIF_ISP_OUT_V_OFFS.
* To use register names with standard convension, please use CIF_ISP_OUT_V_OFFS.
*/
#define	CIFISP_OUT_V_OFFS	(CIF_ISP_OUT_V_OFFS)

/** \\brief  6B0, ISP Output Window Vertical Offset Shadow Register */
#define CIF_ISP_OUT_V_OFFS_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_OUT_V_OFFS_SHD*)0xF90E25B0u)

/** Alias (User Manual Name) for CIF_ISP_OUT_V_OFFS_SHD.
* To use register names with standard convension, please use CIF_ISP_OUT_V_OFFS_SHD.
*/
#define	CIFISP_OUT_V_OFFS_SHD	(CIF_ISP_OUT_V_OFFS_SHD)

/** \\brief  6A0, ISP Output Vertical Picture Size Register */
#define CIF_ISP_OUT_V_SIZE /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_OUT_V_SIZE*)0xF90E25A0u)

/** Alias (User Manual Name) for CIF_ISP_OUT_V_SIZE.
* To use register names with standard convension, please use CIF_ISP_OUT_V_SIZE.
*/
#define	CIFISP_OUT_V_SIZE	(CIF_ISP_OUT_V_SIZE)

/** \\brief  6B8, ISP Output Vertical Picture Size Shadow Register */
#define CIF_ISP_OUT_V_SIZE_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_OUT_V_SIZE_SHD*)0xF90E25B8u)

/** Alias (User Manual Name) for CIF_ISP_OUT_V_SIZE_SHD.
* To use register names with standard convension, please use CIF_ISP_OUT_V_SIZE_SHD.
*/
#define	CIFISP_OUT_V_SIZE_SHD	(CIF_ISP_OUT_V_SIZE_SHD)

/** \\brief  6C0, ISP Raw Interrupt Status Register */
#define CIF_ISP_RIS /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_RIS*)0xF90E25C0u)

/** Alias (User Manual Name) for CIF_ISP_RIS.
* To use register names with standard convension, please use CIF_ISP_RIS.
*/
#define	CIFISP_RIS	(CIF_ISP_RIS)

/** \\brief  2400, ISP Image Stabilization Control Register */
#define CIF_ISPIS_CTRL /*lint --e(923)*/ (*(volatile Ifx_CIF_ISPIS_CTRL*)0xF90E4300u)

/** Alias (User Manual Name) for CIF_ISPIS_CTRL.
* To use register names with standard convension, please use CIF_ISPIS_CTRL.
*/
#define	CIFISPIS_CTRL	(CIF_ISPIS_CTRL)

/** \\brief  2420, ISP Image Stabilization Camera Displacement Register */
#define CIF_ISPIS_DISPLACE /*lint --e(923)*/ (*(volatile Ifx_CIF_ISPIS_DISPLACE*)0xF90E4320u)

/** Alias (User Manual Name) for CIF_ISPIS_DISPLACE.
* To use register names with standard convension, please use CIF_ISPIS_DISPLACE.
*/
#define	CIFISPIS_DISPLACE	(CIF_ISPIS_DISPLACE)

/** \\brief  2408, ISP Image Stabilization Horizontal Offset Of Output Window
 * Register */
#define CIF_ISPIS_H_OFFS /*lint --e(923)*/ (*(volatile Ifx_CIF_ISPIS_H_OFFS*)0xF90E4308u)

/** Alias (User Manual Name) for CIF_ISPIS_H_OFFS.
* To use register names with standard convension, please use CIF_ISPIS_H_OFFS.
*/
#define	CIFISPIS_H_OFFS	(CIF_ISPIS_H_OFFS)

/** \\brief  2424, SP Image Current Horizontal Offset Of Output Window Shadow
 * Register */
#define CIF_ISPIS_H_OFFS_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_ISPIS_H_OFFS_SHD*)0xF90E4324u)

/** Alias (User Manual Name) for CIF_ISPIS_H_OFFS_SHD.
* To use register names with standard convension, please use CIF_ISPIS_H_OFFS_SHD.
*/
#define	CIFISPIS_H_OFFS_SHD	(CIF_ISPIS_H_OFFS_SHD)

/** \\brief  2410, ISP Image Stabilization Output Horizontal Picture Size
 * Register */
#define CIF_ISPIS_H_SIZE /*lint --e(923)*/ (*(volatile Ifx_CIF_ISPIS_H_SIZE*)0xF90E4310u)

