keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCif_reg.h
/** Alias (User Manual Name) for CIF_ISPIS_H_SIZE.
* To use register names with standard convension, please use CIF_ISPIS_H_SIZE.
*/
#define	CIFISPIS_H_SIZE	(CIF_ISPIS_H_SIZE)

/** \\brief  242C, ISP Image Current Output Horizontal Picture Size Shadow
 * Register */
#define CIF_ISPIS_H_SIZE_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_ISPIS_H_SIZE_SHD*)0xF90E432Cu)

/** Alias (User Manual Name) for CIF_ISPIS_H_SIZE_SHD.
* To use register names with standard convension, please use CIF_ISPIS_H_SIZE_SHD.
*/
#define	CIFISPIS_H_SIZE_SHD	(CIF_ISPIS_H_SIZE_SHD)

/** \\brief  2418, ISP Image Stabilization Maximum Horizontal Displacement
 * Register */
#define CIF_ISPIS_MAX_DX /*lint --e(923)*/ (*(volatile Ifx_CIF_ISPIS_MAX_DX*)0xF90E4318u)

/** Alias (User Manual Name) for CIF_ISPIS_MAX_DX.
* To use register names with standard convension, please use CIF_ISPIS_MAX_DX.
*/
#define	CIFISPIS_MAX_DX	(CIF_ISPIS_MAX_DX)

/** \\brief  241C, ISP Image Stabilization Maximum Vertical Displacement
 * Register */
#define CIF_ISPIS_MAX_DY /*lint --e(923)*/ (*(volatile Ifx_CIF_ISPIS_MAX_DY*)0xF90E431Cu)

/** Alias (User Manual Name) for CIF_ISPIS_MAX_DY.
* To use register names with standard convension, please use CIF_ISPIS_MAX_DY.
*/
#define	CIFISPIS_MAX_DY	(CIF_ISPIS_MAX_DY)

/** \\brief  2404, ISP Image Stabilization Recenter Register */
#define CIF_ISPIS_RECENTER /*lint --e(923)*/ (*(volatile Ifx_CIF_ISPIS_RECENTER*)0xF90E4304u)

/** Alias (User Manual Name) for CIF_ISPIS_RECENTER.
* To use register names with standard convension, please use CIF_ISPIS_RECENTER.
*/
#define	CIFISPIS_RECENTER	(CIF_ISPIS_RECENTER)

/** \\brief  240C, ISP Image Stabilization Vertical Offset Of Output Window
 * Register */
#define CIF_ISPIS_V_OFFS /*lint --e(923)*/ (*(volatile Ifx_CIF_ISPIS_V_OFFS*)0xF90E430Cu)

/** Alias (User Manual Name) for CIF_ISPIS_V_OFFS.
* To use register names with standard convension, please use CIF_ISPIS_V_OFFS.
*/
#define	CIFISPIS_V_OFFS	(CIF_ISPIS_V_OFFS)

/** \\brief  2428, ISP Image Current Vertical Offset Of Output Window Shadow
 * Register */
#define CIF_ISPIS_V_OFFS_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_ISPIS_V_OFFS_SHD*)0xF90E4328u)

/** Alias (User Manual Name) for CIF_ISPIS_V_OFFS_SHD.
* To use register names with standard convension, please use CIF_ISPIS_V_OFFS_SHD.
*/
#define	CIFISPIS_V_OFFS_SHD	(CIF_ISPIS_V_OFFS_SHD)

/** \\brief  2414, ISP Image Stabilization Output Vertical Picture Size Register */
#define CIF_ISPIS_V_SIZE /*lint --e(923)*/ (*(volatile Ifx_CIF_ISPIS_V_SIZE*)0xF90E4314u)

/** Alias (User Manual Name) for CIF_ISPIS_V_SIZE.
* To use register names with standard convension, please use CIF_ISPIS_V_SIZE.
*/
#define	CIFISPIS_V_SIZE	(CIF_ISPIS_V_SIZE)

/** \\brief  2430, ISP Image Current Output Vertical Picture Size Shadow
 * Register */
#define CIF_ISPIS_V_SIZE_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_ISPIS_V_SIZE_SHD*)0xF90E4330u)

/** Alias (User Manual Name) for CIF_ISPIS_V_SIZE_SHD.
* To use register names with standard convension, please use CIF_ISPIS_V_SIZE_SHD.
*/
#define	CIFISPIS_V_SIZE_SHD	(CIF_ISPIS_V_SIZE_SHD)

/** \\brief  1938, JPE Huffman Table Selector For AC Values Register */
#define CIF_JPE_AC_TABLE_SELECT /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_AC_TABLE_SELECT*)0xF90E3838u)

/** Alias (User Manual Name) for CIF_JPE_AC_TABLE_SELECT.
* To use register names with standard convension, please use CIF_JPE_AC_TABLE_SELECT.
*/
#define	CIFJPE_AC_TABLE_SELECT	(CIF_JPE_AC_TABLE_SELECT)

/** \\brief  1910, JPE Cb/Cr Value Scaling Control Register */
#define CIF_JPE_CBCR_SCALE_EN /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_CBCR_SCALE_EN*)0xF90E3810u)

/** Alias (User Manual Name) for CIF_JPE_CBCR_SCALE_EN.
* To use register names with standard convension, please use CIF_JPE_CBCR_SCALE_EN.
*/
#define	CIFJPE_CBCR_SCALE_EN	(CIF_JPE_CBCR_SCALE_EN)

/** \\brief  1934, JPE Huffman Table Selector For DC Values Register */
#define CIF_JPE_DC_TABLE_SELECT /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_DC_TABLE_SELECT*)0xF90E3834u)

/** Alias (User Manual Name) for CIF_JPE_DC_TABLE_SELECT.
* To use register names with standard convension, please use CIF_JPE_DC_TABLE_SELECT.
*/
#define	CIFJPE_DC_TABLE_SELECT	(CIF_JPE_DC_TABLE_SELECT)

/** \\brief  1964, JPE Debug Information Register */
#define CIF_JPE_DEBUG /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_DEBUG*)0xF90E3864u)

/** Alias (User Manual Name) for CIF_JPE_DEBUG.
* To use register names with standard convension, please use CIF_JPE_DEBUG.
*/
#define	CIFJPE_DEBUG	(CIF_JPE_DEBUG)

/** \\brief  1918, JPEG Codec Horizontal Image Size For Encoding Register */
#define CIF_JPE_ENC_HSIZE /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_ENC_HSIZE*)0xF90E3818u)

/** Alias (User Manual Name) for CIF_JPE_ENC_HSIZE.
* To use register names with standard convension, please use CIF_JPE_ENC_HSIZE.
*/
#define	CIFJPE_ENC_HSIZE	(CIF_JPE_ENC_HSIZE)

/** \\brief  191C, JPEG Codec Vertical Image Size For Encoding Register */
#define CIF_JPE_ENC_VSIZE /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_ENC_VSIZE*)0xF90E381Cu)

/** Alias (User Manual Name) for CIF_JPE_ENC_VSIZE.
* To use register names with standard convension, please use CIF_JPE_ENC_VSIZE.
*/
#define	CIFJPE_ENC_VSIZE	(CIF_JPE_ENC_VSIZE)

/** \\brief  1904, JPE Start Command To Start JFIF Stream Encoding Register */
#define CIF_JPE_ENCODE /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_ENCODE*)0xF90E3804u)

/** Alias (User Manual Name) for CIF_JPE_ENCODE.
* To use register names with standard convension, please use CIF_JPE_ENCODE.
*/
#define	CIFJPE_ENCODE	(CIF_JPE_ENCODE)

/** \\brief  1960, JPE Encode Mode Register */
#define CIF_JPE_ENCODE_MODE /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_ENCODE_MODE*)0xF90E3860u)

/** Alias (User Manual Name) for CIF_JPE_ENCODE_MODE.
* To use register names with standard convension, please use CIF_JPE_ENCODE_MODE.
*/
#define	CIFJPE_ENCODE_MODE	(CIF_JPE_ENCODE_MODE)

/** \\brief  1958, JPE Encoder Status Flag Register */
#define CIF_JPE_ENCODER_BUSY /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_ENCODER_BUSY*)0xF90E3858u)

/** Alias (User Manual Name) for CIF_JPE_ENCODER_BUSY.
* To use register names with standard convension, please use CIF_JPE_ENCODER_BUSY.
*/
#define	CIFJPE_ENCODER_BUSY	(CIF_JPE_ENCODER_BUSY)

