keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCif_reg.h
/** \\brief  1974, JPE Error Interrupt Clear Register */
#define CIF_JPE_ERROR_ICR /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_ERROR_ICR*)0xF90E3874u)

/** Alias (User Manual Name) for CIF_JPE_ERROR_ICR.
* To use register names with standard convension, please use CIF_JPE_ERROR_ICR.
*/
#define	CIFJPE_ERROR_ICR	(CIF_JPE_ERROR_ICR)

/** \\brief  1968, JPE Error Interrupt Mask Register */
#define CIF_JPE_ERROR_IMR /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_ERROR_IMR*)0xF90E3868u)

/** Alias (User Manual Name) for CIF_JPE_ERROR_IMR.
* To use register names with standard convension, please use CIF_JPE_ERROR_IMR.
*/
#define	CIFJPE_ERROR_IMR	(CIF_JPE_ERROR_IMR)

/** \\brief  1978, JPE Error Interrupt Set Register */
#define CIF_JPE_ERROR_ISR /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_ERROR_ISR*)0xF90E3878u)

/** Alias (User Manual Name) for CIF_JPE_ERROR_ISR.
* To use register names with standard convension, please use CIF_JPE_ERROR_ISR.
*/
#define	CIFJPE_ERROR_ISR	(CIF_JPE_ERROR_ISR)

/** \\brief  1970, JPE Error Masked Interrupt Status Register */
#define CIF_JPE_ERROR_MIS /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_ERROR_MIS*)0xF90E3870u)

/** Alias (User Manual Name) for CIF_JPE_ERROR_MIS.
* To use register names with standard convension, please use CIF_JPE_ERROR_MIS.
*/
#define	CIFJPE_ERROR_MIS	(CIF_JPE_ERROR_MIS)

/** \\brief  196C, JPE Error Raw Interrupt Status Register */
#define CIF_JPE_ERROR_RIS /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_ERROR_RIS*)0xF90E386Cu)

/** Alias (User Manual Name) for CIF_JPE_ERROR_RIS.
* To use register names with standard convension, please use CIF_JPE_ERROR_RIS.
*/
#define	CIFJPE_ERROR_RIS	(CIF_JPE_ERROR_RIS)

/** \\brief  1900, JPE Command To Start Stream Header Generation Register */
#define CIF_JPE_GEN_HEADER /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_GEN_HEADER*)0xF90E3800u)

/** Alias (User Manual Name) for CIF_JPE_GEN_HEADER.
* To use register names with standard convension, please use CIF_JPE_GEN_HEADER.
*/
#define	CIFJPE_GEN_HEADER	(CIF_JPE_GEN_HEADER)

/** \\brief  195C, JPE Header Mode Definition Register */
#define CIF_JPE_HEADER_MODE /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_HEADER_MODE*)0xF90E385Cu)

/** Alias (User Manual Name) for CIF_JPE_HEADER_MODE.
* To use register names with standard convension, please use CIF_JPE_HEADER_MODE.
*/
#define	CIFJPE_HEADER_MODE	(CIF_JPE_HEADER_MODE)

/** \\brief  1908, JPE Automatic Configuration Update Register */
#define CIF_JPE_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_INIT*)0xF90E3808u)

/** Alias (User Manual Name) for CIF_JPE_INIT.
* To use register names with standard convension, please use CIF_JPE_INIT.
*/
#define	CIFJPE_INIT	(CIF_JPE_INIT)

/** \\brief  1920, JPEG Picture Encoding Format Register */
#define CIF_JPE_PIC_FORMAT /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_PIC_FORMAT*)0xF90E3820u)

/** Alias (User Manual Name) for CIF_JPE_PIC_FORMAT.
* To use register names with standard convension, please use CIF_JPE_PIC_FORMAT.
*/
#define	CIFJPE_PIC_FORMAT	(CIF_JPE_PIC_FORMAT)

/** \\brief  1924, JPE Restart Marker Insertion Register */
#define CIF_JPE_RESTART_INTERVAL /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_RESTART_INTERVAL*)0xF90E3824u)

/** Alias (User Manual Name) for CIF_JPE_RESTART_INTERVAL.
* To use register names with standard convension, please use CIF_JPE_RESTART_INTERVAL.
*/
#define	CIFJPE_RESTART_INTERVAL	(CIF_JPE_RESTART_INTERVAL)

/** \\brief  1988, JPEG Status Interrupt Clear Register */
#define CIF_JPE_STATUS_ICR /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_STATUS_ICR*)0xF90E3888u)

/** Alias (User Manual Name) for CIF_JPE_STATUS_ICR.
* To use register names with standard convension, please use CIF_JPE_STATUS_ICR.
*/
#define	CIFJPE_STATUS_ICR	(CIF_JPE_STATUS_ICR)

/** \\brief  197C, JPEG Status Interrupt Mask Register */
#define CIF_JPE_STATUS_IMR /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_STATUS_IMR*)0xF90E387Cu)

/** Alias (User Manual Name) for CIF_JPE_STATUS_IMR.
* To use register names with standard convension, please use CIF_JPE_STATUS_IMR.
*/
#define	CIFJPE_STATUS_IMR	(CIF_JPE_STATUS_IMR)

/** \\brief  198C, JPEG Status Interrupt Set Register */
#define CIF_JPE_STATUS_ISR /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_STATUS_ISR*)0xF90E388Cu)

/** Alias (User Manual Name) for CIF_JPE_STATUS_ISR.
* To use register names with standard convension, please use CIF_JPE_STATUS_ISR.
*/
#define	CIFJPE_STATUS_ISR	(CIF_JPE_STATUS_ISR)

/** \\brief  1984, JPEG Status Masked Interrupt Status Register */
#define CIF_JPE_STATUS_MIS /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_STATUS_MIS*)0xF90E3884u)

/** Alias (User Manual Name) for CIF_JPE_STATUS_MIS.
* To use register names with standard convension, please use CIF_JPE_STATUS_MIS.
*/
#define	CIFJPE_STATUS_MIS	(CIF_JPE_STATUS_MIS)

/** \\brief  1980, JPEG Status Raw Interrupt Status Register */
#define CIF_JPE_STATUS_RIS /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_STATUS_RIS*)0xF90E3880u)

/** Alias (User Manual Name) for CIF_JPE_STATUS_RIS.
* To use register names with standard convension, please use CIF_JPE_STATUS_RIS.
*/
#define	CIFJPE_STATUS_RIS	(CIF_JPE_STATUS_RIS)

/** \\brief  193C, JPE Table Programming Register */
#define CIF_JPE_TABLE_DATA /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_TABLE_DATA*)0xF90E383Cu)

/** Alias (User Manual Name) for CIF_JPE_TABLE_DATA.
* To use register names with standard convension, please use CIF_JPE_TABLE_DATA.
*/
#define	CIFJPE_TABLE_DATA	(CIF_JPE_TABLE_DATA)

/** \\brief  1914, JPE Header Generation Debug Register */
#define CIF_JPE_TABLE_FLUSH /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_TABLE_FLUSH*)0xF90E3814u)

/** Alias (User Manual Name) for CIF_JPE_TABLE_FLUSH.
* To use register names with standard convension, please use CIF_JPE_TABLE_FLUSH.
*/
#define	CIFJPE_TABLE_FLUSH	(CIF_JPE_TABLE_FLUSH)

/** \\brief  1940, JPE Table Programming Select Register */
#define CIF_JPE_TABLE_ID /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_TABLE_ID*)0xF90E3840u)

/** Alias (User Manual Name) for CIF_JPE_TABLE_ID.
* To use register names with standard convension, please use CIF_JPE_TABLE_ID.
*/
#define	CIFJPE_TABLE_ID	(CIF_JPE_TABLE_ID)

/** \\brief  1944, JPE Huffman AC Table 0 Length Register */
#define CIF_JPE_TAC0_LEN /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_TAC0_LEN*)0xF90E3844u)

