keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCif_reg.h
/** Alias (User Manual Name) for CIF_JPE_TAC0_LEN.
* To use register names with standard convension, please use CIF_JPE_TAC0_LEN.
*/
#define	CIFJPE_TAC0_LEN	(CIF_JPE_TAC0_LEN)

/** \\brief  194C, JPE Huffman AC Table 1 Length Register */
#define CIF_JPE_TAC1_LEN /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_TAC1_LEN*)0xF90E384Cu)

/** Alias (User Manual Name) for CIF_JPE_TAC1_LEN.
* To use register names with standard convension, please use CIF_JPE_TAC1_LEN.
*/
#define	CIFJPE_TAC1_LEN	(CIF_JPE_TAC1_LEN)

/** \\brief  1948, JPE Huffman DC Table 0 Length Register */
#define CIF_JPE_TDC0_LEN /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_TDC0_LEN*)0xF90E3848u)

/** Alias (User Manual Name) for CIF_JPE_TDC0_LEN.
* To use register names with standard convension, please use CIF_JPE_TDC0_LEN.
*/
#define	CIFJPE_TDC0_LEN	(CIF_JPE_TDC0_LEN)

/** \\brief  1950, JPE Huffman DC Table 1 Length Register */
#define CIF_JPE_TDC1_LEN /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_TDC1_LEN*)0xF90E3850u)

/** Alias (User Manual Name) for CIF_JPE_TDC1_LEN.
* To use register names with standard convension, please use CIF_JPE_TDC1_LEN.
*/
#define	CIFJPE_TDC1_LEN	(CIF_JPE_TDC1_LEN)

/** \\brief  192C, Q- table Selector 1, Quant. Table For U Component */
#define CIF_JPE_TQ_U_SELECT /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_TQ_U_SELECT*)0xF90E382Cu)

/** Alias (User Manual Name) for CIF_JPE_TQ_U_SELECT.
* To use register names with standard convension, please use CIF_JPE_TQ_U_SELECT.
*/
#define	CIFJPE_TQ_U_SELECT	(CIF_JPE_TQ_U_SELECT)

/** \\brief  1930, Q- table Selector 2 Quant Table For V Component */
#define CIF_JPE_TQ_V_SELECT /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_TQ_V_SELECT*)0xF90E3830u)

/** Alias (User Manual Name) for CIF_JPE_TQ_V_SELECT.
* To use register names with standard convension, please use CIF_JPE_TQ_V_SELECT.
*/
#define	CIFJPE_TQ_V_SELECT	(CIF_JPE_TQ_V_SELECT)

/** \\brief  1928, Q- table Selector 0 Quant Table For Y Component */
#define CIF_JPE_TQ_Y_SELECT /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_TQ_Y_SELECT*)0xF90E3828u)

/** Alias (User Manual Name) for CIF_JPE_TQ_Y_SELECT.
* To use register names with standard convension, please use CIF_JPE_TQ_Y_SELECT.
*/
#define	CIFJPE_TQ_Y_SELECT	(CIF_JPE_TQ_Y_SELECT)

/** \\brief  190C, JPE Y Value Scaling Control Register */
#define CIF_JPE_Y_SCALE_EN /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_Y_SCALE_EN*)0xF90E380Cu)

/** Alias (User Manual Name) for CIF_JPE_Y_SCALE_EN.
* To use register names with standard convension, please use CIF_JPE_Y_SCALE_EN.
*/
#define	CIFJPE_Y_SCALE_EN	(CIF_JPE_Y_SCALE_EN)

/** \\brief  2600, Linear Downscaler Control Register */
#define CIF_LDS_CTRL /*lint --e(923)*/ (*(volatile Ifx_CIF_LDS_CTRL*)0xF90E4500u)

/** Alias (User Manual Name) for CIF_LDS_CTRL.
* To use register names with standard convension, please use CIF_LDS_CTRL.
*/
#define	CIFLDS_CTRL	(CIF_LDS_CTRL)

/** \\brief  2604, Linear Downscaler Factor Register */
#define CIF_LDS_FAC /*lint --e(923)*/ (*(volatile Ifx_CIF_LDS_FAC*)0xF90E4504u)

/** Alias (User Manual Name) for CIF_LDS_FAC.
* To use register names with standard convension, please use CIF_LDS_FAC.
*/
#define	CIFLDS_FAC	(CIF_LDS_FAC)

/** \\brief  1570, Memory Interface Counter Value of JPEG or RAW Data Bytes
 * Register */
#define CIF_MI_BYTE_CNT /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_BYTE_CNT*)0xF90E3470u)

/** Alias (User Manual Name) for CIF_MI_BYTE_CNT.
* To use register names with standard convension, please use CIF_MI_BYTE_CNT.
*/
#define	CIFMI_BYTE_CNT	(CIF_MI_BYTE_CNT)

/** \\brief  1500, Memory Interface Global Control Register */
#define CIF_MI_CTRL /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_CTRL*)0xF90E3400u)

/** Alias (User Manual Name) for CIF_MI_CTRL.
* To use register names with standard convension, please use CIF_MI_CTRL.
*/
#define	CIFMI_CTRL	(CIF_MI_CTRL)

/** \\brief  1574, Memory Interface Global Control Internal Shadow Register */
#define CIF_MI_CTRL_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_CTRL_SHD*)0xF90E3474u)

/** Alias (User Manual Name) for CIF_MI_CTRL_SHD.
* To use register names with standard convension, please use CIF_MI_CTRL_SHD.
*/
#define	CIFMI_CTRL_SHD	(CIF_MI_CTRL_SHD)

/** \\brief  1604, MI Interrupt Clear Register */
#define CIF_MI_ICR /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_ICR*)0xF90E3504u)

/** Alias (User Manual Name) for CIF_MI_ICR.
* To use register names with standard convension, please use CIF_MI_ICR.
*/
#define	CIFMI_ICR	(CIF_MI_ICR)

/** \\brief  15F8, MI Interrupt Mask ‘1’ interrupt active ‘0’ interrupt masked */
#define CIF_MI_IMSC /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_IMSC*)0xF90E34F8u)

/** Alias (User Manual Name) for CIF_MI_IMSC.
* To use register names with standard convension, please use CIF_MI_IMSC.
*/
#define	CIFMI_IMSC	(CIF_MI_IMSC)

/** \\brief  1504, Memory Interface Control Register For Address Init And Skip
 * Function Register */
#define CIF_MI_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_INIT*)0xF90E3404u)

/** Alias (User Manual Name) for CIF_MI_INIT.
* To use register names with standard convension, please use CIF_MI_INIT.
*/
#define	CIFMI_INIT	(CIF_MI_INIT)

/** \\brief  1608, MI Interrupt Set Register */
#define CIF_MI_ISR /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_ISR*)0xF90E3508u)

/** Alias (User Manual Name) for CIF_MI_ISR.
* To use register names with standard convension, please use CIF_MI_ISR.
*/
#define	CIFMI_ISR	(CIF_MI_ISR)

/** \\brief  1600, MI Masked Interrupt Status Registe */
#define CIF_MI_MIS /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MIS*)0xF90E3500u)

/** Alias (User Manual Name) for CIF_MI_MIS.
* To use register names with standard convension, please use CIF_MI_MIS.
*/
#define	CIFMI_MIS	(CIF_MI_MIS)

/** \\brief  151C, Memory Interface Base Address For Main Picture Cb Component
 * Ring Buffer Register */
#define CIF_MI_MP_CB_BASE_AD_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_CB_BASE_AD_INIT*)0xF90E341Cu)

/** Alias (User Manual Name) for CIF_MI_MP_CB_BASE_AD_INIT.
* To use register names with standard convension, please use CIF_MI_MP_CB_BASE_AD_INIT.
*/
#define	CIFMI_MP_CB_BASE_AD_INIT	(CIF_MI_MP_CB_BASE_AD_INIT)

/** \\brief  1588, Memory Interface Base Address Shadow Register For Main
 * Picture Cb Component Ring Register */
#define CIF_MI_MP_CB_BASE_AD_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_CB_BASE_AD_SHD*)0xF90E3488u)

/** Alias (User Manual Name) for CIF_MI_MP_CB_BASE_AD_SHD.
* To use register names with standard convension, please use CIF_MI_MP_CB_BASE_AD_SHD.
*/
#define	CIFMI_MP_CB_BASE_AD_SHD	(CIF_MI_MP_CB_BASE_AD_SHD)

