keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCif_reg.h
/** \\brief  1524, Memory Interface Offset Counter Init Value For Main Picture
 * Cb Component Ring Buffer Register */
#define CIF_MI_MP_CB_OFFS_CNT_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_CB_OFFS_CNT_INIT*)0xF90E3424u)

/** Alias (User Manual Name) for CIF_MI_MP_CB_OFFS_CNT_INIT.
* To use register names with standard convension, please use CIF_MI_MP_CB_OFFS_CNT_INIT.
*/
#define	CIFMI_MP_CB_OFFS_CNT_INIT	(CIF_MI_MP_CB_OFFS_CNT_INIT)

/** \\brief  1590, Memory Interface Current Offset Counter Of Main Picture Cb
 * Component Ring Buffer Register */
#define CIF_MI_MP_CB_OFFS_CNT_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_CB_OFFS_CNT_SHD*)0xF90E3490u)

/** Alias (User Manual Name) for CIF_MI_MP_CB_OFFS_CNT_SHD.
* To use register names with standard convension, please use CIF_MI_MP_CB_OFFS_CNT_SHD.
*/
#define	CIFMI_MP_CB_OFFS_CNT_SHD	(CIF_MI_MP_CB_OFFS_CNT_SHD)

/** \\brief  1528, Memory Interface Offset Counter Start Value For Main Picture
 * Cb Component Ring Buffer Register */
#define CIF_MI_MP_CB_OFFS_CNT_START /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_CB_OFFS_CNT_START*)0xF90E3428u)

/** Alias (User Manual Name) for CIF_MI_MP_CB_OFFS_CNT_START.
* To use register names with standard convension, please use CIF_MI_MP_CB_OFFS_CNT_START.
*/
#define	CIFMI_MP_CB_OFFS_CNT_START	(CIF_MI_MP_CB_OFFS_CNT_START)

/** \\brief  1520, Memory Interface Size Of Main Picture Cb Component Ring
 * Buffer Register */
#define CIF_MI_MP_CB_SIZE_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_CB_SIZE_INIT*)0xF90E3420u)

/** Alias (User Manual Name) for CIF_MI_MP_CB_SIZE_INIT.
* To use register names with standard convension, please use CIF_MI_MP_CB_SIZE_INIT.
*/
#define	CIFMI_MP_CB_SIZE_INIT	(CIF_MI_MP_CB_SIZE_INIT)

/** \\brief  158C, Memory Interface Size Shadow Register Of Main Picture Cb
 * Component Ring Buffer Register */
#define CIF_MI_MP_CB_SIZE_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_CB_SIZE_SHD*)0xF90E348Cu)

/** Alias (User Manual Name) for CIF_MI_MP_CB_SIZE_SHD.
* To use register names with standard convension, please use CIF_MI_MP_CB_SIZE_SHD.
*/
#define	CIFMI_MP_CB_SIZE_SHD	(CIF_MI_MP_CB_SIZE_SHD)

/** \\brief  152C, Memory Interface Base Address For Main Picture Cr Component
 * Ring Buffer Register */
#define CIF_MI_MP_CR_BASE_AD_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_CR_BASE_AD_INIT*)0xF90E342Cu)

/** Alias (User Manual Name) for CIF_MI_MP_CR_BASE_AD_INIT.
* To use register names with standard convension, please use CIF_MI_MP_CR_BASE_AD_INIT.
*/
#define	CIFMI_MP_CR_BASE_AD_INIT	(CIF_MI_MP_CR_BASE_AD_INIT)

/** \\brief  1594, Memory Interface Base Address Shadow Register For Main
 * Picture Cr Component Ring Register */
#define CIF_MI_MP_CR_BASE_AD_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_CR_BASE_AD_SHD*)0xF90E3494u)

/** Alias (User Manual Name) for CIF_MI_MP_CR_BASE_AD_SHD.
* To use register names with standard convension, please use CIF_MI_MP_CR_BASE_AD_SHD.
*/
#define	CIFMI_MP_CR_BASE_AD_SHD	(CIF_MI_MP_CR_BASE_AD_SHD)

/** \\brief  1534, Memory Interface Offset Counter Init value For Main Picture
 * Cr Component Ring Buffer Register */
#define CIF_MI_MP_CR_OFFS_CNT_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_CR_OFFS_CNT_INIT*)0xF90E3434u)

/** Alias (User Manual Name) for CIF_MI_MP_CR_OFFS_CNT_INIT.
* To use register names with standard convension, please use CIF_MI_MP_CR_OFFS_CNT_INIT.
*/
#define	CIFMI_MP_CR_OFFS_CNT_INIT	(CIF_MI_MP_CR_OFFS_CNT_INIT)

/** \\brief  159C, Memory Interface Current Offset Counter Of Main Picture Cr
 * Component Ring Buffer Register */
#define CIF_MI_MP_CR_OFFS_CNT_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_CR_OFFS_CNT_SHD*)0xF90E349Cu)

/** Alias (User Manual Name) for CIF_MI_MP_CR_OFFS_CNT_SHD.
* To use register names with standard convension, please use CIF_MI_MP_CR_OFFS_CNT_SHD.
*/
#define	CIFMI_MP_CR_OFFS_CNT_SHD	(CIF_MI_MP_CR_OFFS_CNT_SHD)

/** \\brief  1538, Memory Interface Offset Counter Start Value For Main Picture
 * Cr Component Ring Buffer Register */
#define CIF_MI_MP_CR_OFFS_CNT_START /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_CR_OFFS_CNT_START*)0xF90E3438u)

/** Alias (User Manual Name) for CIF_MI_MP_CR_OFFS_CNT_START.
* To use register names with standard convension, please use CIF_MI_MP_CR_OFFS_CNT_START.
*/
#define	CIFMI_MP_CR_OFFS_CNT_START	(CIF_MI_MP_CR_OFFS_CNT_START)

/** \\brief  1530, Memory Interface Size Of Main Picture Cr Component Ring
 * Buffer Register */
#define CIF_MI_MP_CR_SIZE_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_CR_SIZE_INIT*)0xF90E3430u)

/** Alias (User Manual Name) for CIF_MI_MP_CR_SIZE_INIT.
* To use register names with standard convension, please use CIF_MI_MP_CR_SIZE_INIT.
*/
#define	CIFMI_MP_CR_SIZE_INIT	(CIF_MI_MP_CR_SIZE_INIT)

/** \\brief  1598, Memory Interface Size Shadow Register Of Main Picture Cr
 * Component Ring Buffer Register */
#define CIF_MI_MP_CR_SIZE_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_CR_SIZE_SHD*)0xF90E3498u)

/** Alias (User Manual Name) for CIF_MI_MP_CR_SIZE_SHD.
* To use register names with standard convension, please use CIF_MI_MP_CR_SIZE_SHD.
*/
#define	CIFMI_MP_CR_SIZE_SHD	(CIF_MI_MP_CR_SIZE_SHD)

/** \\brief  1508, Memory Interface Base Address For Main Picture Y Component,
 * JPEG or RAW Data Register */
#define CIF_MI_MP_Y_BASE_AD_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_Y_BASE_AD_INIT*)0xF90E3408u)

/** Alias (User Manual Name) for CIF_MI_MP_Y_BASE_AD_INIT.
* To use register names with standard convension, please use CIF_MI_MP_Y_BASE_AD_INIT.
*/
#define	CIFMI_MP_Y_BASE_AD_INIT	(CIF_MI_MP_Y_BASE_AD_INIT)

/** \\brief  1578, Memory Interface Base Address Shadow Register For Main
 * Picture Y Component, JPEG Register */
#define CIF_MI_MP_Y_BASE_AD_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_Y_BASE_AD_SHD*)0xF90E3478u)

/** Alias (User Manual Name) for CIF_MI_MP_Y_BASE_AD_SHD.
* To use register names with standard convension, please use CIF_MI_MP_Y_BASE_AD_SHD.
*/
#define	CIFMI_MP_Y_BASE_AD_SHD	(CIF_MI_MP_Y_BASE_AD_SHD)

/** \\brief  1518, Memory Interface Fill Level Interrupt Offset Value For Main
 * Picture Y, JPEG or RAW Data Register */
#define CIF_MI_MP_Y_IRQ_OFFS_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_Y_IRQ_OFFS_INIT*)0xF90E3418u)

/** Alias (User Manual Name) for CIF_MI_MP_Y_IRQ_OFFS_INIT.
* To use register names with standard convension, please use CIF_MI_MP_Y_IRQ_OFFS_INIT.
*/
#define	CIFMI_MP_Y_IRQ_OFFS_INIT	(CIF_MI_MP_Y_IRQ_OFFS_INIT)

/** \\brief  1584, Memory Interface Shadow Register of Fill Level Interrupt
 * Offset Value For Main Picture Y Register */
#define CIF_MI_MP_Y_IRQ_OFFS_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_Y_IRQ_OFFS_SHD*)0xF90E3484u)

