keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCif_reg.h
/** Alias (User Manual Name) for CIF_MI_MP_Y_IRQ_OFFS_SHD.
* To use register names with standard convension, please use CIF_MI_MP_Y_IRQ_OFFS_SHD.
*/
#define	CIFMI_MP_Y_IRQ_OFFS_SHD	(CIF_MI_MP_Y_IRQ_OFFS_SHD)

/** \\brief  1510, Memory Interface Offset Counter Init Value For Main Picture
 * Y, JPEG or RAW Data Register */
#define CIF_MI_MP_Y_OFFS_CNT_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_Y_OFFS_CNT_INIT*)0xF90E3410u)

/** Alias (User Manual Name) for CIF_MI_MP_Y_OFFS_CNT_INIT.
* To use register names with standard convension, please use CIF_MI_MP_Y_OFFS_CNT_INIT.
*/
#define	CIFMI_MP_Y_OFFS_CNT_INIT	(CIF_MI_MP_Y_OFFS_CNT_INIT)

/** \\brief  1580, Memory Interface Current Offset Counter of Main Picture Y
 * Component JPEG or RAW Register */
#define CIF_MI_MP_Y_OFFS_CNT_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_Y_OFFS_CNT_SHD*)0xF90E3480u)

/** Alias (User Manual Name) for CIF_MI_MP_Y_OFFS_CNT_SHD.
* To use register names with standard convension, please use CIF_MI_MP_Y_OFFS_CNT_SHD.
*/
#define	CIFMI_MP_Y_OFFS_CNT_SHD	(CIF_MI_MP_Y_OFFS_CNT_SHD)

/** \\brief  1514, Memory Interface Offset Counter Start Value For Main Picture
 * Y, JPEG or RAW Data Register */
#define CIF_MI_MP_Y_OFFS_CNT_START /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_Y_OFFS_CNT_START*)0xF90E3414u)

/** Alias (User Manual Name) for CIF_MI_MP_Y_OFFS_CNT_START.
* To use register names with standard convension, please use CIF_MI_MP_Y_OFFS_CNT_START.
*/
#define	CIFMI_MP_Y_OFFS_CNT_START	(CIF_MI_MP_Y_OFFS_CNT_START)

/** \\brief  150C, Memory Interface Size of main picture Y component, JPEG or
 * RAW data Register */
#define CIF_MI_MP_Y_SIZE_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_Y_SIZE_INIT*)0xF90E340Cu)

/** Alias (User Manual Name) for CIF_MI_MP_Y_SIZE_INIT.
* To use register names with standard convension, please use CIF_MI_MP_Y_SIZE_INIT.
*/
#define	CIFMI_MP_Y_SIZE_INIT	(CIF_MI_MP_Y_SIZE_INIT)

/** \\brief  157C, Memory Interface Size Shadow Register of Main Picture Y
 * Component,JPEG or RAW Data Register */
#define CIF_MI_MP_Y_SIZE_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_Y_SIZE_SHD*)0xF90E347Cu)

/** Alias (User Manual Name) for CIF_MI_MP_Y_SIZE_SHD.
* To use register names with standard convension, please use CIF_MI_MP_Y_SIZE_SHD.
*/
#define	CIFMI_MP_Y_SIZE_SHD	(CIF_MI_MP_Y_SIZE_SHD)

/** \\brief  15FC, MI Raw Interrupt Status Register */
#define CIF_MI_RIS /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_RIS*)0xF90E34FCu)

/** Alias (User Manual Name) for CIF_MI_RIS.
* To use register names with standard convension, please use CIF_MI_RIS.
*/
#define	CIFMI_RIS	(CIF_MI_RIS)

/** \\brief  160C, MI Status Register */
#define CIF_MI_STATUS /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_STATUS*)0xF90E350Cu)

/** Alias (User Manual Name) for CIF_MI_STATUS.
* To use register names with standard convension, please use CIF_MI_STATUS.
*/
#define	CIFMI_STATUS	(CIF_MI_STATUS)

/** \\brief  1610, MI Status Clear Register */
#define CIF_MI_STATUS_CLR /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_STATUS_CLR*)0xF90E3510u)

/** Alias (User Manual Name) for CIF_MI_STATUS_CLR.
* To use register names with standard convension, please use CIF_MI_STATUS_CLR.
*/
#define	CIFMI_STATUS_CLR	(CIF_MI_STATUS_CLR)

/** \\brief  3608, Memory Interface Base Address For Extra Path Data Buffer
 * Register */
#define CIF_MIEP_CH_1S0_BASE_AD_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_BASE_AD_INIT*)0xF90E5508u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S0_BASE_AD_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S0_BASE_AD_INIT.
*/
#define	CIFMIEP_1_BASE_AD_INIT	(CIF_MIEP_CH_1S0_BASE_AD_INIT)

/** \\brief  3620, Memory Interface Base Address Shadow Register for Extra Path
 * Buffer Register */
#define CIF_MIEP_CH_1S0_BASE_AD_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_BASE_AD_SHD*)0xF90E5520u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S0_BASE_AD_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S0_BASE_AD_SHD.
*/
#define	CIFMIEP_1_BASE_AD_SHD	(CIF_MIEP_CH_1S0_BASE_AD_SHD)

/** \\brief  3600, Memory Interface Extra Path Control Register */
#define CIF_MIEP_CH_1S0_CTRL /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_CTRL*)0xF90E5500u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S0_CTRL.
* To use register names with standard convension, please use CIF_MIEP_CH_1S0_CTRL.
*/
#define	CIFMIEP_1_CTRL	(CIF_MIEP_CH_1S0_CTRL)

/** \\brief  361C, Memory Interface Extra Path Control Internal Shadow Register */
#define CIF_MIEP_CH_1S0_CTRL_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_CTRL_SHD*)0xF90E551Cu)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S0_CTRL_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S0_CTRL_SHD.
*/
#define	CIFMIEP_1_CTRL_SHD	(CIF_MIEP_CH_1S0_CTRL_SHD)

/** \\brief  3604, Memory Interface Extra Path Control Register For Address Init
 * And Skip Function Register */
#define CIF_MIEP_CH_1S0_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_INIT*)0xF90E5504u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S0_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S0_INIT.
*/
#define	CIFMIEP_1_INIT	(CIF_MIEP_CH_1S0_INIT)

/** \\brief  3618, Memory Interface Fill Level Interrupt Offset Value For Extra
 * Path Register */
#define CIF_MIEP_CH_1S0_IRQ_OFFS_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_IRQ_OFFS_INIT*)0xF90E5518u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S0_IRQ_OFFS_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S0_IRQ_OFFS_INIT.
*/
#define	CIFMIEP_1_IRQ_OFFS_INIT	(CIF_MIEP_CH_1S0_IRQ_OFFS_INIT)

/** \\brief  362C, Memory Interface Shadow Register of Fill Level Interrupt
 * Offset Value For Extra Path Register */
#define CIF_MIEP_CH_1S0_IRQ_OFFS_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_IRQ_OFFS_SHD*)0xF90E552Cu)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S0_IRQ_OFFS_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S0_IRQ_OFFS_SHD.
*/
#define	CIFMIEP_1_IRQ_OFFS_SHD	(CIF_MIEP_CH_1S0_IRQ_OFFS_SHD)

