keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCif_reg.h
/** \\brief  3610, Memory Interface Offset Counter Init Value For Extra Path
 * Buffer Register */
#define CIF_MIEP_CH_1S0_OFFS_CNT_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_OFFS_CNT_INIT*)0xF90E5510u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S0_OFFS_CNT_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S0_OFFS_CNT_INIT.
*/
#define	CIFMIEP_1_OFFS_CNT_INIT	(CIF_MIEP_CH_1S0_OFFS_CNT_INIT)

/** \\brief  3628, Memory Interface Current Offset Counter of Extra Path Buffer
 * Register */
#define CIF_MIEP_CH_1S0_OFFS_CNT_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_OFFS_CNT_SHD*)0xF90E5528u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S0_OFFS_CNT_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S0_OFFS_CNT_SHD.
*/
#define	CIFMIEP_1_OFFS_CNT_SHD	(CIF_MIEP_CH_1S0_OFFS_CNT_SHD)

/** \\brief  3614, Memory Interface Offset Counter Start Value For Extra Path
 * Register */
#define CIF_MIEP_CH_1S0_OFFS_CNT_START /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_OFFS_CNT_START*)0xF90E5514u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S0_OFFS_CNT_START.
* To use register names with standard convension, please use CIF_MIEP_CH_1S0_OFFS_CNT_START.
*/
#define	CIFMIEP_1_OFFS_CNT_START	(CIF_MIEP_CH_1S0_OFFS_CNT_START)

/** \\brief  360C, Memory Interface Size of Extra Path Data Buffer Register */
#define CIF_MIEP_CH_1S0_SIZE_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_SIZE_INIT*)0xF90E550Cu)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S0_SIZE_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S0_SIZE_INIT.
*/
#define	CIFMIEP_1_SIZE_INIT	(CIF_MIEP_CH_1S0_SIZE_INIT)

/** \\brief  3624, Memory Interface Size Shadow Register of Extra Path Buffer
 * Register */
#define CIF_MIEP_CH_1S0_SIZE_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_SIZE_SHD*)0xF90E5524u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S0_SIZE_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S0_SIZE_SHD.
*/
#define	CIFMIEP_1_SIZE_SHD	(CIF_MIEP_CH_1S0_SIZE_SHD)

/** \\brief  3708, Memory Interface Base Address For Extra Path Data Buffer
 * Register */
#define CIF_MIEP_CH_1S1_BASE_AD_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_BASE_AD_INIT*)0xF90E5608u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S1_BASE_AD_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S1_BASE_AD_INIT.
*/
#define	CIFMIEP_2_BASE_AD_INIT	(CIF_MIEP_CH_1S1_BASE_AD_INIT)

/** \\brief  3720, Memory Interface Base Address Shadow Register for Extra Path
 * Buffer Register */
#define CIF_MIEP_CH_1S1_BASE_AD_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_BASE_AD_SHD*)0xF90E5620u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S1_BASE_AD_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S1_BASE_AD_SHD.
*/
#define	CIFMIEP_2_BASE_AD_SHD	(CIF_MIEP_CH_1S1_BASE_AD_SHD)

/** \\brief  3700, Memory Interface Extra Path Control Register */
#define CIF_MIEP_CH_1S1_CTRL /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_CTRL*)0xF90E5600u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S1_CTRL.
* To use register names with standard convension, please use CIF_MIEP_CH_1S1_CTRL.
*/
#define	CIFMIEP_2_CTRL	(CIF_MIEP_CH_1S1_CTRL)

/** \\brief  371C, Memory Interface Extra Path Control Internal Shadow Register */
#define CIF_MIEP_CH_1S1_CTRL_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_CTRL_SHD*)0xF90E561Cu)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S1_CTRL_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S1_CTRL_SHD.
*/
#define	CIFMIEP_2_CTRL_SHD	(CIF_MIEP_CH_1S1_CTRL_SHD)

/** \\brief  3704, Memory Interface Extra Path Control Register For Address Init
 * And Skip Function Register */
#define CIF_MIEP_CH_1S1_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_INIT*)0xF90E5604u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S1_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S1_INIT.
*/
#define	CIFMIEP_2_INIT	(CIF_MIEP_CH_1S1_INIT)

/** \\brief  3718, Memory Interface Fill Level Interrupt Offset Value For Extra
 * Path Register */
#define CIF_MIEP_CH_1S1_IRQ_OFFS_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_IRQ_OFFS_INIT*)0xF90E5618u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S1_IRQ_OFFS_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S1_IRQ_OFFS_INIT.
*/
#define	CIFMIEP_2_IRQ_OFFS_INIT	(CIF_MIEP_CH_1S1_IRQ_OFFS_INIT)

/** \\brief  372C, Memory Interface Shadow Register of Fill Level Interrupt
 * Offset Value For Extra Path Register */
#define CIF_MIEP_CH_1S1_IRQ_OFFS_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_IRQ_OFFS_SHD*)0xF90E562Cu)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S1_IRQ_OFFS_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S1_IRQ_OFFS_SHD.
*/
#define	CIFMIEP_2_IRQ_OFFS_SHD	(CIF_MIEP_CH_1S1_IRQ_OFFS_SHD)

/** \\brief  3710, Memory Interface Offset Counter Init Value For Extra Path
 * Buffer Register */
#define CIF_MIEP_CH_1S1_OFFS_CNT_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_OFFS_CNT_INIT*)0xF90E5610u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S1_OFFS_CNT_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S1_OFFS_CNT_INIT.
*/
#define	CIFMIEP_2_OFFS_CNT_INIT	(CIF_MIEP_CH_1S1_OFFS_CNT_INIT)

/** \\brief  3728, Memory Interface Current Offset Counter of Extra Path Buffer
 * Register */
#define CIF_MIEP_CH_1S1_OFFS_CNT_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_OFFS_CNT_SHD*)0xF90E5628u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S1_OFFS_CNT_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S1_OFFS_CNT_SHD.
*/
#define	CIFMIEP_2_OFFS_CNT_SHD	(CIF_MIEP_CH_1S1_OFFS_CNT_SHD)

/** \\brief  3714, Memory Interface Offset Counter Start Value For Extra Path
 * Register */
#define CIF_MIEP_CH_1S1_OFFS_CNT_START /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_OFFS_CNT_START*)0xF90E5614u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S1_OFFS_CNT_START.
* To use register names with standard convension, please use CIF_MIEP_CH_1S1_OFFS_CNT_START.
*/
#define	CIFMIEP_2_OFFS_CNT_START	(CIF_MIEP_CH_1S1_OFFS_CNT_START)

/** \\brief  370C, Memory Interface Size of Extra Path Data Buffer Register */
#define CIF_MIEP_CH_1S1_SIZE_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_SIZE_INIT*)0xF90E560Cu)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S1_SIZE_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S1_SIZE_INIT.
*/
#define	CIFMIEP_2_SIZE_INIT	(CIF_MIEP_CH_1S1_SIZE_INIT)

/** \\brief  3724, Memory Interface Size Shadow Register of Extra Path Buffer
 * Register */
#define CIF_MIEP_CH_1S1_SIZE_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_SIZE_SHD*)0xF90E5624u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S1_SIZE_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S1_SIZE_SHD.
*/
#define	CIFMIEP_2_SIZE_SHD	(CIF_MIEP_CH_1S1_SIZE_SHD)

/** \\brief  3808, Memory Interface Base Address For Extra Path Data Buffer
 * Register */
#define CIF_MIEP_CH_1S2_BASE_AD_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_BASE_AD_INIT*)0xF90E5708u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S2_BASE_AD_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S2_BASE_AD_INIT.
*/
#define	CIFMIEP_3_BASE_AD_INIT	(CIF_MIEP_CH_1S2_BASE_AD_INIT)

/** \\brief  3820, Memory Interface Base Address Shadow Register for Extra Path
 * Buffer Register */
#define CIF_MIEP_CH_1S2_BASE_AD_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_BASE_AD_SHD*)0xF90E5720u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S2_BASE_AD_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S2_BASE_AD_SHD.
*/
#define	CIFMIEP_3_BASE_AD_SHD	(CIF_MIEP_CH_1S2_BASE_AD_SHD)

/** \\brief  3800, Memory Interface Extra Path Control Register */
#define CIF_MIEP_CH_1S2_CTRL /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_CTRL*)0xF90E5700u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S2_CTRL.
* To use register names with standard convension, please use CIF_MIEP_CH_1S2_CTRL.
*/
#define	CIFMIEP_3_CTRL	(CIF_MIEP_CH_1S2_CTRL)

/** \\brief  381C, Memory Interface Extra Path Control Internal Shadow Register */
#define CIF_MIEP_CH_1S2_CTRL_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_CTRL_SHD*)0xF90E571Cu)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S2_CTRL_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S2_CTRL_SHD.
*/
#define	CIFMIEP_3_CTRL_SHD	(CIF_MIEP_CH_1S2_CTRL_SHD)

