keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCif_reg.h
/** \\brief  3804, Memory Interface Extra Path Control Register For Address Init
 * And Skip Function Register */
#define CIF_MIEP_CH_1S2_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_INIT*)0xF90E5704u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S2_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S2_INIT.
*/
#define	CIFMIEP_3_INIT	(CIF_MIEP_CH_1S2_INIT)

/** \\brief  3818, Memory Interface Fill Level Interrupt Offset Value For Extra
 * Path Register */
#define CIF_MIEP_CH_1S2_IRQ_OFFS_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_IRQ_OFFS_INIT*)0xF90E5718u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S2_IRQ_OFFS_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S2_IRQ_OFFS_INIT.
*/
#define	CIFMIEP_3_IRQ_OFFS_INIT	(CIF_MIEP_CH_1S2_IRQ_OFFS_INIT)

/** \\brief  382C, Memory Interface Shadow Register of Fill Level Interrupt
 * Offset Value For Extra Path Register */
#define CIF_MIEP_CH_1S2_IRQ_OFFS_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_IRQ_OFFS_SHD*)0xF90E572Cu)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S2_IRQ_OFFS_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S2_IRQ_OFFS_SHD.
*/
#define	CIFMIEP_3_IRQ_OFFS_SHD	(CIF_MIEP_CH_1S2_IRQ_OFFS_SHD)

/** \\brief  3810, Memory Interface Offset Counter Init Value For Extra Path
 * Buffer Register */
#define CIF_MIEP_CH_1S2_OFFS_CNT_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_OFFS_CNT_INIT*)0xF90E5710u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S2_OFFS_CNT_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S2_OFFS_CNT_INIT.
*/
#define	CIFMIEP_3_OFFS_CNT_INIT	(CIF_MIEP_CH_1S2_OFFS_CNT_INIT)

/** \\brief  3828, Memory Interface Current Offset Counter of Extra Path Buffer
 * Register */
#define CIF_MIEP_CH_1S2_OFFS_CNT_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_OFFS_CNT_SHD*)0xF90E5728u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S2_OFFS_CNT_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S2_OFFS_CNT_SHD.
*/
#define	CIFMIEP_3_OFFS_CNT_SHD	(CIF_MIEP_CH_1S2_OFFS_CNT_SHD)

/** \\brief  3814, Memory Interface Offset Counter Start Value For Extra Path
 * Register */
#define CIF_MIEP_CH_1S2_OFFS_CNT_START /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_OFFS_CNT_START*)0xF90E5714u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S2_OFFS_CNT_START.
* To use register names with standard convension, please use CIF_MIEP_CH_1S2_OFFS_CNT_START.
*/
#define	CIFMIEP_3_OFFS_CNT_START	(CIF_MIEP_CH_1S2_OFFS_CNT_START)

/** \\brief  380C, Memory Interface Size of Extra Path Data Buffer Register */
#define CIF_MIEP_CH_1S2_SIZE_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_SIZE_INIT*)0xF90E570Cu)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S2_SIZE_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S2_SIZE_INIT.
*/
#define	CIFMIEP_3_SIZE_INIT	(CIF_MIEP_CH_1S2_SIZE_INIT)

/** \\brief  3824, Memory Interface Size Shadow Register of Extra Path Buffer
 * Register */
#define CIF_MIEP_CH_1S2_SIZE_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_SIZE_SHD*)0xF90E5724u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S2_SIZE_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S2_SIZE_SHD.
*/
#define	CIFMIEP_3_SIZE_SHD	(CIF_MIEP_CH_1S2_SIZE_SHD)

/** \\brief  3908, Memory Interface Base Address For Extra Path Data Buffer
 * Register */
#define CIF_MIEP_CH_1S3_BASE_AD_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_BASE_AD_INIT*)0xF90E5808u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S3_BASE_AD_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S3_BASE_AD_INIT.
*/
#define	CIFMIEP_4_BASE_AD_INIT	(CIF_MIEP_CH_1S3_BASE_AD_INIT)

/** \\brief  3920, Memory Interface Base Address Shadow Register for Extra Path
 * Buffer Register */
#define CIF_MIEP_CH_1S3_BASE_AD_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_BASE_AD_SHD*)0xF90E5820u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S3_BASE_AD_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S3_BASE_AD_SHD.
*/
#define	CIFMIEP_4_BASE_AD_SHD	(CIF_MIEP_CH_1S3_BASE_AD_SHD)

/** \\brief  3900, Memory Interface Extra Path Control Register */
#define CIF_MIEP_CH_1S3_CTRL /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_CTRL*)0xF90E5800u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S3_CTRL.
* To use register names with standard convension, please use CIF_MIEP_CH_1S3_CTRL.
*/
#define	CIFMIEP_4_CTRL	(CIF_MIEP_CH_1S3_CTRL)

/** \\brief  391C, Memory Interface Extra Path Control Internal Shadow Register */
#define CIF_MIEP_CH_1S3_CTRL_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_CTRL_SHD*)0xF90E581Cu)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S3_CTRL_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S3_CTRL_SHD.
*/
#define	CIFMIEP_4_CTRL_SHD	(CIF_MIEP_CH_1S3_CTRL_SHD)

/** \\brief  3904, Memory Interface Extra Path Control Register For Address Init
 * And Skip Function Register */
#define CIF_MIEP_CH_1S3_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_INIT*)0xF90E5804u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S3_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S3_INIT.
*/
#define	CIFMIEP_4_INIT	(CIF_MIEP_CH_1S3_INIT)

/** \\brief  3918, Memory Interface Fill Level Interrupt Offset Value For Extra
 * Path Register */
#define CIF_MIEP_CH_1S3_IRQ_OFFS_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_IRQ_OFFS_INIT*)0xF90E5818u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S3_IRQ_OFFS_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S3_IRQ_OFFS_INIT.
*/
#define	CIFMIEP_4_IRQ_OFFS_INIT	(CIF_MIEP_CH_1S3_IRQ_OFFS_INIT)

/** \\brief  392C, Memory Interface Shadow Register of Fill Level Interrupt
 * Offset Value For Extra Path Register */
#define CIF_MIEP_CH_1S3_IRQ_OFFS_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_IRQ_OFFS_SHD*)0xF90E582Cu)

