keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCif_reg.h
/** Alias (User Manual Name) for CIF_MIEP_CH_1S3_IRQ_OFFS_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S3_IRQ_OFFS_SHD.
*/
#define	CIFMIEP_4_IRQ_OFFS_SHD	(CIF_MIEP_CH_1S3_IRQ_OFFS_SHD)

/** \\brief  3910, Memory Interface Offset Counter Init Value For Extra Path
 * Buffer Register */
#define CIF_MIEP_CH_1S3_OFFS_CNT_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_OFFS_CNT_INIT*)0xF90E5810u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S3_OFFS_CNT_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S3_OFFS_CNT_INIT.
*/
#define	CIFMIEP_4_OFFS_CNT_INIT	(CIF_MIEP_CH_1S3_OFFS_CNT_INIT)

/** \\brief  3928, Memory Interface Current Offset Counter of Extra Path Buffer
 * Register */
#define CIF_MIEP_CH_1S3_OFFS_CNT_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_OFFS_CNT_SHD*)0xF90E5828u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S3_OFFS_CNT_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S3_OFFS_CNT_SHD.
*/
#define	CIFMIEP_4_OFFS_CNT_SHD	(CIF_MIEP_CH_1S3_OFFS_CNT_SHD)

/** \\brief  3914, Memory Interface Offset Counter Start Value For Extra Path
 * Register */
#define CIF_MIEP_CH_1S3_OFFS_CNT_START /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_OFFS_CNT_START*)0xF90E5814u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S3_OFFS_CNT_START.
* To use register names with standard convension, please use CIF_MIEP_CH_1S3_OFFS_CNT_START.
*/
#define	CIFMIEP_4_OFFS_CNT_START	(CIF_MIEP_CH_1S3_OFFS_CNT_START)

/** \\brief  390C, Memory Interface Size of Extra Path Data Buffer Register */
#define CIF_MIEP_CH_1S3_SIZE_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_SIZE_INIT*)0xF90E580Cu)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S3_SIZE_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S3_SIZE_INIT.
*/
#define	CIFMIEP_4_SIZE_INIT	(CIF_MIEP_CH_1S3_SIZE_INIT)

/** \\brief  3924, Memory Interface Size Shadow Register of Extra Path Buffer
 * Register */
#define CIF_MIEP_CH_1S3_SIZE_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_SIZE_SHD*)0xF90E5824u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S3_SIZE_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S3_SIZE_SHD.
*/
#define	CIFMIEP_4_SIZE_SHD	(CIF_MIEP_CH_1S3_SIZE_SHD)

/** \\brief  3A08, Memory Interface Base Address For Extra Path Data Buffer
 * Register */
#define CIF_MIEP_CH_1S4_BASE_AD_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_BASE_AD_INIT*)0xF90E5908u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S4_BASE_AD_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S4_BASE_AD_INIT.
*/
#define	CIFMIEP_5_BASE_AD_INIT	(CIF_MIEP_CH_1S4_BASE_AD_INIT)

/** \\brief  3A20, Memory Interface Base Address Shadow Register for Extra Path
 * Buffer Register */
#define CIF_MIEP_CH_1S4_BASE_AD_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_BASE_AD_SHD*)0xF90E5920u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S4_BASE_AD_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S4_BASE_AD_SHD.
*/
#define	CIFMIEP_5_BASE_AD_SHD	(CIF_MIEP_CH_1S4_BASE_AD_SHD)

/** \\brief  3A00, Memory Interface Extra Path Control Register */
#define CIF_MIEP_CH_1S4_CTRL /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_CTRL*)0xF90E5900u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S4_CTRL.
* To use register names with standard convension, please use CIF_MIEP_CH_1S4_CTRL.
*/
#define	CIFMIEP_5_CTRL	(CIF_MIEP_CH_1S4_CTRL)

/** \\brief  3A1C, Memory Interface Extra Path Control Internal Shadow Register */
#define CIF_MIEP_CH_1S4_CTRL_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_CTRL_SHD*)0xF90E591Cu)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S4_CTRL_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S4_CTRL_SHD.
*/
#define	CIFMIEP_5_CTRL_SHD	(CIF_MIEP_CH_1S4_CTRL_SHD)

/** \\brief  3A04, Memory Interface Extra Path Control Register For Address Init
 * And Skip Function Register */
#define CIF_MIEP_CH_1S4_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_INIT*)0xF90E5904u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S4_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S4_INIT.
*/
#define	CIFMIEP_5_INIT	(CIF_MIEP_CH_1S4_INIT)

/** \\brief  3A18, Memory Interface Fill Level Interrupt Offset Value For Extra
 * Path Register */
#define CIF_MIEP_CH_1S4_IRQ_OFFS_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_IRQ_OFFS_INIT*)0xF90E5918u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S4_IRQ_OFFS_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S4_IRQ_OFFS_INIT.
*/
#define	CIFMIEP_5_IRQ_OFFS_INIT	(CIF_MIEP_CH_1S4_IRQ_OFFS_INIT)

/** \\brief  3A2C, Memory Interface Shadow Register of Fill Level Interrupt
 * Offset Value For Extra Path Register */
#define CIF_MIEP_CH_1S4_IRQ_OFFS_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_IRQ_OFFS_SHD*)0xF90E592Cu)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S4_IRQ_OFFS_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S4_IRQ_OFFS_SHD.
*/
#define	CIFMIEP_5_IRQ_OFFS_SHD	(CIF_MIEP_CH_1S4_IRQ_OFFS_SHD)

/** \\brief  3A10, Memory Interface Offset Counter Init Value For Extra Path
 * Buffer Register */
#define CIF_MIEP_CH_1S4_OFFS_CNT_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_OFFS_CNT_INIT*)0xF90E5910u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S4_OFFS_CNT_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S4_OFFS_CNT_INIT.
*/
#define	CIFMIEP_5_OFFS_CNT_INIT	(CIF_MIEP_CH_1S4_OFFS_CNT_INIT)

/** \\brief  3A28, Memory Interface Current Offset Counter of Extra Path Buffer
 * Register */
#define CIF_MIEP_CH_1S4_OFFS_CNT_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_OFFS_CNT_SHD*)0xF90E5928u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S4_OFFS_CNT_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S4_OFFS_CNT_SHD.
*/
#define	CIFMIEP_5_OFFS_CNT_SHD	(CIF_MIEP_CH_1S4_OFFS_CNT_SHD)

/** \\brief  3A14, Memory Interface Offset Counter Start Value For Extra Path
 * Register */
#define CIF_MIEP_CH_1S4_OFFS_CNT_START /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_OFFS_CNT_START*)0xF90E5914u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S4_OFFS_CNT_START.
* To use register names with standard convension, please use CIF_MIEP_CH_1S4_OFFS_CNT_START.
*/
#define	CIFMIEP_5_OFFS_CNT_START	(CIF_MIEP_CH_1S4_OFFS_CNT_START)

