keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCif_reg.h
/** \\brief  3A0C, Memory Interface Size of Extra Path Data Buffer Register */
#define CIF_MIEP_CH_1S4_SIZE_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_SIZE_INIT*)0xF90E590Cu)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S4_SIZE_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S4_SIZE_INIT.
*/
#define	CIFMIEP_5_SIZE_INIT	(CIF_MIEP_CH_1S4_SIZE_INIT)

/** \\brief  3A24, Memory Interface Size Shadow Register of Extra Path Buffer
 * Register */
#define CIF_MIEP_CH_1S4_SIZE_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_SIZE_SHD*)0xF90E5924u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S4_SIZE_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S4_SIZE_SHD.
*/
#define	CIFMIEP_5_SIZE_SHD	(CIF_MIEP_CH_1S4_SIZE_SHD)

/** \\brief  3514, MI Extra Path Interrupt Clear Register */
#define CIF_MIEP_ICR /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_ICR*)0xF90E5414u)

/** Alias (User Manual Name) for CIF_MIEP_ICR.
* To use register names with standard convension, please use CIF_MIEP_ICR.
*/
#define	CIFMIEP_ICR	(CIF_MIEP_ICR)

/** \\brief  3508, MI Extra Path Interrupt Mask ‘1’: interrupt active, ‘0’:
 * interrupt masked */
#define CIF_MIEP_IMSC /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_IMSC*)0xF90E5408u)

/** Alias (User Manual Name) for CIF_MIEP_IMSC.
* To use register names with standard convension, please use CIF_MIEP_IMSC.
*/
#define	CIFMIEP_IMSC	(CIF_MIEP_IMSC)

/** \\brief  3518, MI Extra Path Interrupt Set Register */
#define CIF_MIEP_ISR /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_ISR*)0xF90E5418u)

/** Alias (User Manual Name) for CIF_MIEP_ISR.
* To use register names with standard convension, please use CIF_MIEP_ISR.
*/
#define	CIFMIEP_ISR	(CIF_MIEP_ISR)

/** \\brief  3510, MI Extra Path Masked Interrupt Status Register */
#define CIF_MIEP_MIS /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_MIS*)0xF90E5410u)

/** Alias (User Manual Name) for CIF_MIEP_MIS.
* To use register names with standard convension, please use CIF_MIEP_MIS.
*/
#define	CIFMIEP_MIS	(CIF_MIEP_MIS)

/** \\brief  350C, MI Extra Path Raw Interrupt Status Register */
#define CIF_MIEP_RIS /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_RIS*)0xF90E540Cu)

/** Alias (User Manual Name) for CIF_MIEP_RIS.
* To use register names with standard convension, please use CIF_MIEP_RIS.
*/
#define	CIFMIEP_RIS	(CIF_MIEP_RIS)

/** \\brief  3500, Extra Path Error Register */
#define CIF_MIEP_STA_ERR /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_STA_ERR*)0xF90E5400u)

/** Alias (User Manual Name) for CIF_MIEP_STA_ERR.
* To use register names with standard convension, please use CIF_MIEP_STA_ERR.
*/
#define	CIFMIEP_STA_ERR	(CIF_MIEP_STA_ERR)

/** \\brief  3504, Extra Path Error Clear Register */
#define CIF_MIEP_STA_ERR_CLR /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_STA_ERR_CLR*)0xF90E5404u)

/** Alias (User Manual Name) for CIF_MIEP_STA_ERR_CLR.
* To use register names with standard convension, please use CIF_MIEP_STA_ERR_CLR.
*/
#define	CIFMIEP_STA_ERR_CLR	(CIF_MIEP_STA_ERR_CLR)

/** \\brief  2500, Watchdog Control Register */
#define CIF_WD_CTRL /*lint --e(923)*/ (*(volatile Ifx_CIF_WD_CTRL*)0xF90E4400u)

/** Alias (User Manual Name) for CIF_WD_CTRL.
* To use register names with standard convension, please use CIF_WD_CTRL.
*/
#define	CIFWD_CTRL	(CIF_WD_CTRL)

/** \\brief  2508, Watchdog Horizontal Timeout Register */
#define CIF_WD_H_TIMEOUT /*lint --e(923)*/ (*(volatile Ifx_CIF_WD_H_TIMEOUT*)0xF90E4408u)

/** Alias (User Manual Name) for CIF_WD_H_TIMEOUT.
* To use register names with standard convension, please use CIF_WD_H_TIMEOUT.
*/
#define	CIFWD_H_TIMEOUT	(CIF_WD_H_TIMEOUT)

/** \\brief  2518, Watchdog Interrupt Clear Register */
#define CIF_WD_ICR /*lint --e(923)*/ (*(volatile Ifx_CIF_WD_ICR*)0xF90E4418u)

/** Alias (User Manual Name) for CIF_WD_ICR.
* To use register names with standard convension, please use CIF_WD_ICR.
*/
#define	CIFWD_ICR	(CIF_WD_ICR)

/** \\brief  250C, Watchdog Interrupt Mask Register */
#define CIF_WD_IMSC /*lint --e(923)*/ (*(volatile Ifx_CIF_WD_IMSC*)0xF90E440Cu)

/** Alias (User Manual Name) for CIF_WD_IMSC.
* To use register names with standard convension, please use CIF_WD_IMSC.
*/
#define	CIFWD_IMSC	(CIF_WD_IMSC)

/** \\brief  251C, Watchdog Interrupt Set Register */
#define CIF_WD_ISR /*lint --e(923)*/ (*(volatile Ifx_CIF_WD_ISR*)0xF90E441Cu)

/** Alias (User Manual Name) for CIF_WD_ISR.
* To use register names with standard convension, please use CIF_WD_ISR.
*/
#define	CIFWD_ISR	(CIF_WD_ISR)

/** \\brief  2514, Watchdog Masked Interrupt Status Register */
#define CIF_WD_MIS /*lint --e(923)*/ (*(volatile Ifx_CIF_WD_MIS*)0xF90E4414u)

/** Alias (User Manual Name) for CIF_WD_MIS.
* To use register names with standard convension, please use CIF_WD_MIS.
*/
#define	CIFWD_MIS	(CIF_WD_MIS)

/** \\brief  2510, Watchdog Raw Interrupt Status Register */
#define CIF_WD_RIS /*lint --e(923)*/ (*(volatile Ifx_CIF_WD_RIS*)0xF90E4410u)

/** Alias (User Manual Name) for CIF_WD_RIS.
* To use register names with standard convension, please use CIF_WD_RIS.
*/
#define	CIFWD_RIS	(CIF_WD_RIS)

/** \\brief  2504, Watchdog Vertical Timeout Register */
#define CIF_WD_V_TIMEOUT /*lint --e(923)*/ (*(volatile Ifx_CIF_WD_V_TIMEOUT*)0xF90E4404u)

/** Alias (User Manual Name) for CIF_WD_V_TIMEOUT.
* To use register names with standard convension, please use CIF_WD_V_TIMEOUT.
*/
#define	CIFWD_V_TIMEOUT	(CIF_WD_V_TIMEOUT)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXCIF_REG_H */
